[
    {
        "link": "https://www.goodreads.com/book/show/44600621-dear-girls?from_choice=true",
        "brand": "Dear Girls: Intimate Tales, Untold Secrets, & Advice for Living Your Best Life",
        "isbn": 9780525508830,
        "reviews": {
            "0": {
                "date": "Oct 23, 2019",
                "content": "I've felt an increasing amount of jealousy and resentment from certain white male comics... I hear that line a lot: 'Me, I'm just another white guy.' Here's a solution: Try being a funnier white guy. I had such a fun time reading this book! Dear Girls was given to me as a gift and, at first, I wasn't sure how much it was really my thing, or even if I was going to read it. I like Ali Wong's stand-up just fine, but I don't read many books by comedians (just Born a Crime, which you definitely\n\nI've felt an increasing amount of jealousy and resentment from certain white male comics... I hear that line a lot: 'Me, I'm just another white guy.' Here's a solution: Try being a funnier white guy.\nI had such a fun time reading this book! Dear Girls was given to me as a gift and, at first, I wasn't sure how much it was really my thing, or even if I was going to read it. I like Ali Wong's stand-up just fine, but I don't read many books by comedians (just Born a Crime, which you definitely should read). Also, I say I like Ali Wong because I love how she tells really relatable stories and doesn't sugarcoat them with nice words, but I'm also not a huge fan of crude humour. Look, I grew up in Yorkshire where everyone has a crude sense of humour. In the beautiful land of God’s Own County, you might hear a passing child yell something about “p***y” (I’m only sorta joking). I'm immune to it at this point.But, you know, this book was really entertaining and surprisingly sweet and heartwarming (in a hilarious way). Wong writes the book as a series of letters to her young daughters-- about life, love, sex, dating, careers, motherhood, and being East Asian. It's a good one of those funny-serious books in that she's talking about important things but is determined to never lose her sense of humour or trim her hairy bush. As we say in Yorkshire, \"good lass\".What Ali Wong does is normalize all the gross and embarrassing stuff that many people do but won't talk about: fart during yoga, grow a huge forest in the pubic region, date multiple guys who lose their erections... it's quite refreshing.Sometimes it seems like Ali Wong is fearless because her comedy is so without inhibition, but she also confesses to her own worries and fears and failures in this book. She leaves her daughters with a powerful message (though they are going to cringe so hard when they finally read this, lol) that it's okay to fail, to mess up, to sleep with the wrong person, to pick yourself up again and laugh about it. How wonderful that these girls have a mother behind them who is simultaneously so strong AND willing to be vulnerable.Oh, and the food. All the talk of delicious food in this book made me so hungry 🤤Blog | Facebook | Twitter | Instagram | Youtube\n...more"
            },
            "1": {
                "date": "Oct 25, 2019",
                "content": "4.5 stars  Right off the bat - a quick PSA to Mari and Nikki (the \"girls\" that Ali refers to in the story) - your mother was right.Do not (ABSOLUTELY DO NOT) read this book before you're 21. In fact, deeply consider reading it at all.There are things that are objectively hilarious (abso-freaking-lutely hilarious) but  horrifying  (stunningly so) when you learn it's your own mother in the center of the story.*ahem* onto the review! That day, my co-workers found out my secret: I'm a fucking idiot.\n4.5 stars\n Right off the bat - a quick PSA to Mari and Nikki (the \"girls\" that Ali refers to in the story) - your mother was right.Do not (ABSOLUTELY DO NOT) read this book before you're 21. In fact, deeply consider reading it at all.There are things that are objectively hilarious (abso-freaking-lutely hilarious) but\n horrifying\n (stunningly so) when you learn it's your own mother in the center of the story.*ahem* onto the review!\nThat day, my co-workers found out my secret: I'm a fucking idiot.\nAli Wong - known for her unfiltered comedy, her hit Netflix comedy special Baby Cobra, and wild life stories - has made a leap into the literary scene. Her book, written is a series of letters to her children, provides honest advice on men and marriage. She challenges working women stereotypes, embraces her Asian culture and doesn't back down from a frank sex talk.We learn how Ali began her career in San Francisco Bay comedy scene before moving to New York. However, that was no picnic. She ran herself ragged sprinting from comedy show to comedy show, auditioning for TV and eventually breaking out in the standup scene. She eventually meets her husband and knew it was true love from their very first yoga session together.\nIt's always challenging not to fart during yoga, but that day, I clenched my cheeks extra tight...\nAnd, (of course) she writes down any and all advice she has for her two children.\nThat became my mantra for motherhood from there on out.You have suffered enough.\nAll in all, this was a really, really good book!A word of warning though - when I say she's unfiltered - I mean it. Don't go into this book expecting to make it through a chapter without talking either about sex, poop or afterbirth. I hadn't known too much about Ali, other than internet clips from her Baby Cobra special, when I went into this book.And now? I'm a fan. Her frank advice on life: \nIf you can make it easier, make it easier, and don't feel guilty about it \n really resonated with me. I loved how she embraces motherhood in a crude, crass way. I haven't had children, but even I know it's not all mommy-blogs and matching onesies. It's refreshing to have someone unapologetically laying it all on the line.If you're a fan of her comedy - or take-no-shit-hold-no-prisoners women - this book is for you!!YouTube | Blog | Instagram | Twitter | Snapchat @miranda.reads\n...more"
            },
            "2": {
                "date": "Aug 29, 2019",
                "content": "I often think about what it would be like for my grandfather to see me now. What would he think about me saying all of the disgusting things I say onstage? How he would feel about his granddaughter talking about what she lusts after? How I obsess over the most trivial problems. How I make a living by talking about what I want. How people pay to see his granddaughter just talk. Hed probably think I was some sort of magician with ancient powers, derived from behaving very well in a past life. Or a\n”I often think about what it would be like for my grandfather to see me now. What would he think about me saying all of the disgusting things I say onstage? How he would feel about his granddaughter talking about what she lusts after? How I obsess over the most trivial problems. How I make a living by talking about what I want. How people pay to see his granddaughter just talk. He’d probably think I was some sort of magician with ancient powers, derived from behaving very well in a past life. Or a witch, I guess. At the very least, he’d definitely have the opposite opinion of all those jealous-ass white male comedians who say things like ‘People only like your comedy because you’re female and a minority.’ My grandpa would be like ‘I can’t believe people like your comedy! You’re a female and a minority.’”I have heard of Ali Wong and have seen her referenced a few times, but have never seen any of her standup. So needless to say, I was leary about reading a memoir about her. This book was recommended to me by someone I trust or I would have never picked it up on my own. I usually like memoirs or biographies by people in the twilight years of their lives or, better yet, dead. I think that comes from being a completist. I want the whole story, not just the first third of someone’s life. So here I am writing a review of a memoir by a woman in her 30s. How extraordinary! What is more amazing is that I gave the book five stars. How is this possible?It is simply impossible not to. Anyone who knows me well has heard my diatribe about movies billed as comedies. It’s not that I don’t like to laugh. I find life a series of comedic events, but I like comedy that occurs naturally, and comedic movies always come across as forced comedy, which ultimately starts to feel flat and fake. I’m soon wishing I’d put in something like In Bruges, where a serious plot is frequently enlivened by comedic elements. So what I’m saying is that I’m a terrible risk for a book like this. Ali Wong chooses to write her book as a series of letters to her children. The title reflects that, but my first reaction is...I’m a guy, so she isn’t really interested in men reading this book. Won’t I feel like I’m peeping in on revealing secrets not intended for me? Of course, the whole idea of Ali Wong having a secret she hasn’t revealed to the world is rather hilarious. Though I do wonder what secret could possibly be so horrendously embarrassing that Wong would not use it for her stand-up comedy routine? So the title does throw me, but I quickly shake it off as I become caught up in her narrative. It isn’t long before I am thinking...don’t tell your daughters that! My lifetime of brainwashed conditioning showing itself, sporting a wagging finger and disapproving look. By the end of the book, I feel like Wong has taken a scrub brush of whitewash to those elements of my mind. Full disclosure: I did watch her ass wiggle as she scrubbed. I would apologize, but then she’d have to bring her scrub brush back to have another go. Reading this book is going to make you uncomfortable. It may even offend you, but keep reading because not only is it good to occasionally be uncomfortable, sometimes you also learn to reserve being offended for those things that most deserve it.I was about half way through the book when I decided to watch her Netflix special Baby Cobra. I wanted to put together the Ali Wong being revealed to me in the book with the stand up comedian and found that the honest evaluation of her lusts, wants, and defects were syncopatico. If there is pretense, it is well hidden.This woman is refreshingly uninhibited. To some that might be code for rude, but it is hard to consider this level of truth to be rude. While watching the special, I loved it when the camera would pan to the audience. Those sideways looks that couples were giving each other, the hand to the face as someone laughed at something they found to be embarrassingly true, and as her husband describes it, “laugh-so-hard-you-pee-reactions.” As compelling as it is to watch Ali’s physical reactions, it was equally fascinating to watch the crowd. If I ever attend one of her events, I’d be tempted to spend the entire skit turned around, observing the crowd. I sort of sprung Baby Cobra on my wife, no warning, no gentle explanations to prepare her for what she was about to see. She is frequently a test subject to gauge normal reactions to abnormal conditions. If I was laughing, I looked over at her so that I would laugh even harder. She was one of those audience members with her hand over her face as she chuckled. She laughed so hard at one time she had trouble breathing. I didn’t ask her if she had a pee reaction. My wife never sweats, but insists she only glistens, so her admitting to any “vulgar” body reactions would be most unusual. The book is hilarious, but it is more than that. She talks a lot about the amount of hard work and dedication it takes to make it as a comedian. She often performed several sets at comedy clubs after working all day. She discusses the added hazard of being a female having to perform in...dives. Can you imagine that walk from the club to her car in the early hours of the morning? She believes that safety is one of the contributing factors as to why there are not more female comedians. She talks about her heritage and her relationship with her extended family. Every immigrant family has an interesting story, and her parents are no exception. She is half Vietnamese and half Chinese, and those two cultures may seem similar in the eyes of many, but they actually have vast differences in philosophical approaches to life. Her husband is also half and half, and she describes their relationship as having the “exact same amount of Asian.” They were both raised as Americans, but their Asian roots heavily influence who they are. Her husband writes an afterward, also addressed to their children, and he is pretty honest about his own personal journey dealing with being frequently the subject of his wife’s comedy. If she were making it all up or exaggerating the circumstances, that would certainly be less of a problem, but the issue, of course, is that she is sending arrows right into the bullseye. I love what he says about her. ”Asian cultures often teach us to be silent about our sexuality and filled with shame. Your mother breaks that up and transmutes pain and shame into power, like a mystical priestess.”So as unlikely as I am to be an Ali Wong fan, I have to say it has happened. Yes, this book is hilarious, but it also touches on serious issues and, for this reader, even proves to be an inspiration. Keep chasing your dreams, work harder, and don’t give up. Few of us want to be as famous as Ali Wong, but most of us wish we could be more successful at something we love to do. Patience grasshopper. Wax on. Wax off. I want to thank Mimi Chan of Goodreads and Random House for supplying me with an advance reading copy in exchange for an honest review. If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at:https://www.facebook.com/JeffreyKeeten\n...more"
            },
            "3": {
                "date": "Oct 28, 2019",
                "content": "CONGRATULATIONS-Goodreads Choice Awards Humor Winner!This was such a reprieve from what turned out to be a heavy month. I can't remember the last time I've laughed so hard, and my only gripe is that I wish there was more! Seriously, I could listen to Ali Wong and her personal brand of female humor all day every day. This was excellent as an audio book read by Wong! Highly recommended."
            },
            "4": {
                "date": "Oct 12, 2019",
                "content": "4.5 StarsDear Girls is a book made up of Ali Wong writing letters (chapters) to her young daughters. The letters are hilarious, cautionary candid tales telling of Ali's life experiences from childhood through adulthood and cumulating into her becoming a mother. She is frank, candid, vulgar and hilariously real about all aspects of her life. She is not afraid to take risks and encourages her daughters to do so but to also learn from the mistakes their mother has made. Her book reads like her\n4.5 StarsDear Girls is a book made up of Ali Wong writing letters (chapters) to her young daughters. The letters are hilarious, cautionary candid tales telling of Ali's life experiences from childhood through adulthood and cumulating into her becoming a mother. She is frank, candid, vulgar and hilariously real about all aspects of her life. She is not afraid to take risks and encourages her daughters to do so but to also learn from the mistakes their mother has made. Her book reads like her stand-up comedy specials (heck she mentions them enough in the book). She is fearless and really puts herself out there and pokes fun at her body, dating, her husband, having immigrants as parents, sex, food, pregnancy, and how taking risks paid off and made her a better person and stand-up comic. You do not need to be a fan of Ali Wong to read this book. I really didn’t know much about her prior to reading this one. I saw a couple of clips on YouTube of her performing while pregnant. If you were not a fan before this book, you will be after reading it. Unless you are turned off by talk of gapping buttholes and her multiple descriptions of her big bush. Seriously, someone needs to introduce this woman to laser hair removal or as least take her to get waxed. Just thinking out loud there.This book is fabulous although it seemed to stop on a dime. It just ended and then there was the afterword written by her husband to their two daughters. Overall, a hilariously funny, frank, raunchy, heartfelt and entertaining read. Thank you to Random House and NetGalley for providing me with a copy of this book in exchange for an honest review. Honestly, it cracked me up and made me smile! All the thoughts and opinions are my own.\n...more"
            },
            "5": {
                "date": "Sep 25, 2019",
                "content": "Ali Wong makes me laugh.... ...she is not only hilariously funny...but underneath her raunchy humor, shes a down-to-earth sweetie-pie luv-bug! Dear Girls is her memoir - -non-fiction book for her fans - ( Im one of them), and anyone curious about her. Its written as a letter to her two young little girls....with instructions: NOT TOBE READ UNTIL AGE 21! I loved this book... I loved reading about Ali.....*everything Ali*!!!We learn about Alis upbringing- and her personal life.... with love for\nAli Wong makes me laugh.... ...she is not only hilariously funny...but underneath her raunchy humor, she’s a down-to-earth sweetie-pie luv-bug! “Dear Girls” is her memoir - -non-fiction book for her fans - ( I’m one of them), and anyone curious about her. It’s written as a letter to her two young little girls....with instructions: NOT TOBE READ UNTIL AGE 21! I loved this book... I loved reading about Ali.....*everything Ali*!!!We learn about Ali’s upbringing- and her personal life.... with love for her ‘handsome Asian husband’, and her two daughters...the heart-of-what-matters-most! A few excerpts below: “One of the worst places I performed regularly at was‘Our Little Theater’. It literally seated eight people and was located in the heart of the Tenderloin district. That neighborhood was home to Southeast Asian refugees, a million drug addicts, and a truly remarkable amount of human feces on the street. There was no time to think about my set when walking to ‘Our Little Theater’ because I was too busy trying not to get robbed and jumping over doo-doo and syringes on the sidewalk. That’s a game of hopscotch you ‘need’ to win. Because if you lose, your consolation prize is ebola”. WORDS of WISDOM fromAli to her daughters:“At some point you gotta go. Mama loves you but it’s so important to get out of your hometown and get the fuck away from your family. As the youngest of four kids, I was always being observed by my siblings, who would judge my every decision. They had a set idea of who I was and it affected me. It was limiting. Everything I said generally had no credence because I was at least ten years younger than every single person in my family, so what did I know? When I got away from them, I finally felt like I could be the person I was meant to be, which just happened to be a person who talked about her wish to put nail polish remover in men’s buttholes so she could accomplish two things at once. Chances are that neither of you is also that person”. “My family had always told me how to speak and how to feel about things. Part of what was so liberating about being on stage was that I could say whatever I wanted without having loved ones comment on it. Regardless of how the strangers would respond, at least they were strangers who didn’t know me or have any real authority over who I was. I loved the anonymity of my conversations with an audience”. Deciding to move to NYC after four years of doing stand up in San Francisco was hard for Ali. She was 26 at the time, and there were girls just out of college ordering her around who had nicer bags and shoes and she did”. “Every day in NYC was about spending as little money as possible. I didn’t see any movies or eat out unless they went out on a date, or it was pizza or falafel. Ninety percent of the time I cooked at the SoHo loft. I’d buy lentils from a bulk bin at the East Village co-op and boil them to eat with salt, like a medieval peasant. And then I’d steam some vegetables from Chinatown. For three dollars and fifty cents, I found a place that sold half of a cooked chicken that was probably loaded with enough antibiotics to turn my blood into Purell”. “Pretty much the worst thing about being a woman in stand-up is that you are always forced to socialize with male stand-up comics’ girlfriends”. Comedy requires taking risks, and Ali takes them. She’s had nights of people yelling ‘boo’. She learned from those devastating nights. She’s a comic that seriously works hard at her craft. She learned early to diversify her crowds. She said yes to every opportunity to do a set in other cities, even if it meant losing money. Ali gives advice to her daughters about stand-up...[don’t do it]...about men, dating, [men should pay on a first date], sex, pregnancy, family, [things she learned from her Vietnamese immigrant mother, siblings, etc.], shoes, [wear flats], about making mistakes [make them], and about the many choices they will make in their lifetime. Ali also shared with her daughters [ and us], shameful things she did in her youth. ....smoked her first cigarette at age 11. ....shoplifted lipstick ....”One New Years Eve when I was seventeen, I made out with thirteen boys and three girls. That’s basically an entire high school production of ‘Oliver’”. ...etc. [she promised her daughters that things get way better after their teen years].How anyone can’t see Ali Wong’s greatness - her warm-hearted honest goodness - her gift to the world as an unguarded human being - is beyond me. Yep... I love Ali’s stand-up...And reading this book was a deeply pleasurable!! The last chapter, the Afterword, is written by Ali’s husband, Justin HakutaHe writes a letter to his girls...“Dear Mari and Nikki”.....Justin is mensch of a husband and father!!Looking forward to listening to the Audiobook! I can already imagine how enjoyable it will be to hear Ali read it!!Thank you Random House, Netgalley, and Ali Wong\n...more"
            },
            "6": {
                "date": "Sep 07, 2019",
                "content": "Let me tell you, it is such a relief to have a funny, well-written book from a comedian that I admire. Man, I've been burned so many times before with mediocre books from comedians, I barely dared to hope with this one. But Ali Wong really delivered. If you are a fan of Ali Wong, you will like this book. I pinky-swear promise. The beginning of the book is pure Ali Wong humor, and if you think think that means vagina and pubic hair jokes, you would be 100% CORRECT. Ali Wong is purely who she is,\nLet me tell you, it is such a relief to have a funny, well-written book from a comedian that I admire. Man, I've been burned so many times before with mediocre books from comedians, I barely dared to hope with this one. But Ali Wong really delivered. If you are a fan of Ali Wong, you will like this book. I pinky-swear promise. The beginning of the book is pure Ali Wong humor, and if you think think that means vagina and pubic hair jokes, you would be 100% CORRECT. Ali Wong is purely who she is, and I love that about her. I think people underestimate her (though not so much anymore, thank you \"Always Be My Maybe\"!), but she is one of the most honest, crassly-amazing comedians out there. I love that she is a parent now, and I related to her stories a ton, even though our upbringing was completely different. I ate up the stories about how she met her husband and how he compared to the (multitude) of men she had dated in the past. She gave me the intimate content I was craving, and, no, I don't mean of her sex life (get your mind out of the gutter!).The second half of the book was a bit less funny and more of an exploration of her ethnic background, which I also enjoyed. Ali Wong showed me a lot about who she is and where she is going, both in her own journey to learn about herself and with her comedy. Sometimes, I think it's too early for a comedian to write a book, but with Ali Wong, it was just right. Both funny and poignant, Ali Wong really nailed it with Dear Girls: Intimate Tales, Untold Secrets, and Advice for Living Your Best Life.*Copy provided in exchange for an honest review*goodreads|instagram|twitter|blog\n...more"
            },
            "7": {
                "date": "Jun 08, 2019",
                "content": "If you want to enjoy this book, don't read the last chapter. \"First, do not read this book until you are over twenty-one. You should not be allowed to know these inappropriate things about me if you cant even buy beer yet.\" Dear Girls is about the messy parts of life, but ends up being a bit of a mess itself. Despite the rough bits, though, it's an enjoyable read. Once you get past the shaky opening chapters, stand-up and TV writer Ali Wong is as frank, hilarious, and graphic as you'd expect. My\nIf you want to enjoy this book, don't read the last chapter.\n\"First, do not read this book until you are over twenty-one. You should not be allowed to know these inappropriate things about me if you can’t even buy beer yet.\"\nDear Girls is about the messy parts of life, but ends up being a bit of a mess itself. Despite the rough bits, though, it's an enjoyable read. Once you get past the shaky opening chapters, stand-up and TV writer Ali Wong is as frank, hilarious, and graphic as you'd expect. My full review goes into more detail about what did and didn't work for me.But if you're enjoying this book, quit while you're ahead, because the last chapter pops the illusion of candor and relatability like a day-old balloon.The final letter is actually from Wong’s husband, and it is so close to self-awareness. The chapter could have been thoughtful and confessional, but it doesn’t quite get there, and ends up a little irritating. The real disappointment, though, comes in the third-to-last paragraph of the book, when Justin Hakuta (Wong’s husband) drops this line:\n\"Who were we to take care of you and nurture such magical beings? But then instinct kicked in, along with relatives and Sofiya, your magical Ukrainian nanny, and we were off and running on our new adventure.\"\nThere’s… a lot to unpack there, and I try to explain on my blog why this soured my experience of the book. It's not that I'm surprised that the family has a nanny, it's that it didn't occur to me that she was missing until the very end. For all her detailed descriptions of post-birth infection and breastfeeding pains, Wong never once mentions who is taking care of her children during the day. She spends an entire chapter talking about the experience of being a stay-at-home full-time parent while on maternity leave, and how taxing it was. She spends paragraphs praising her husband for being so involved even though he still works. Never once, in her “unflinchingly honest” set of letters to her daughters, does Wong mention a woman instrumental in their upbringing. Celebrity memoirs require almost as much suspension of disbelief as novels. To enjoy them, you have to ignore the enormous impact of wealth and resources on the life of the person whose problems you're reading about. You have to look past everything that makes their life different to appreciate the moments when they're Just Like You. Even the most honest of memoirs are a magic trick.Ali Wong almost pulls it off... but if she wanted to seem relatable, she should have either been honest about the help she gets, or not mentioned it at all. Thank you to Random House for providing an advance review copy of this title. No money changed hands for this review and all opinions are my own.\n...more"
            },
            "8": {
                "date": "Feb 12, 2020",
                "content": "This is just not my kind of funny."
            },
            "9": {
                "date": "Jan 12, 2020",
                "content": "Wow! This is brave! This hilarious! I havent laughed so much since Ive seen my husband wear tights and thinks hes hottie in his Robin Hood costume for Halloween. (Of course the entire people who were passing through Hollywood Boulevard agreed with me with their howling laughs. Case closed!) Im a big fan of this evil genius and needs her own thrown at Comedy Kingdom. She is smart. She is relentless. She is ugly honest. She is so confident. She is shining when she takes her place at the stage. (\nWow! This is brave! This hilarious! I haven’t laughed so much since I’ve seen my husband wear tights and thinks he’s hottie in his Robin Hood costume for Halloween. (Of course the entire people who were passing through Hollywood Boulevard agreed with me with their howling laughs. Case closed!) I’m a big fan of this evil genius and needs her own thrown at Comedy Kingdom. She is smart. She is relentless. She is ugly honest. She is so confident. She is shining when she takes her place at the stage. ( Yes, I was lucky enough to see her live performances and screamed too much, nearly be thrown out the comedy club for making so much noise!) This book consists of her letters to her daughters. She’s talking about so many heavy and rigid stuff like making fun with her own body (just like I do every day but I don’t laugh after I humiliate myself! I mostly cry, scream and yell! As a precaution my husband covered the mirrors with blankets. Our house started to look like movie set of Nicole Kidman’s Others movie), her husband ( OMG! Ali should be my best friend forever!), taking risks of life, challenges of being an immigrant, love, sex, dating, career choices, pregnancy etc. And of course there are some disgustingly funny stuff only dark humor lovers like me could get and truly like such as farthing at yoga séance, bushy pubic hair jokes. ( Don’t worry! If you survived from any other Amy Schumer comedy specials, these jokes will be so much softer for your own taste! Oh and I adore dirty Schumer, too!) Being comedian, mocking yourself and loved ones, finding most creative and smartest jokes and being woman when you’re achieving that are the biggest challenges in the industry. Thankfully we have Ali Wong, Amy Schumer, Sarah Silverman, Ellen DeGeneres, Leslie Jones, Hannah Gadsby, Chelsea Peretti, Wanda Skyes, Jen Kirkman ( also created one of our favorite stand up star: Marvelous Mrs. Maisel). There are so many successful, brave, smart, talented females out there doing great job. I just wrote the first names came into my mind) With those women’s talented brains, witty minds, creative, challenging, independent thoughts the world turns into a better place with more laughs, more fun and more vision!So I had amazing time by reading this book. I wish there would be more pages. I laughed so much and probably scared more neighborhood kids, dogs and squirrels. I highly recommend Ali Wong’s “Hard Knock Wife” and “Baby Cobra” comedy specials. If you enjoy this book as much as I did, you won’t want to miss them and get ready to have so so so much fun!\n...more"
            },
            "10": {
                "date": "Jul 11, 2019",
                "content": "I truly feared this book would be fluff. Instead it is fearless and real. Ali Wong says how we all feel:  I'm not fine.  Yet in her resilience and grit she is able to turn childhood resentment, male rejection, discrimination, getting boo'd offstage, the fear of a prenup, and a bushy pussy into the best things that could have happened to her. I laughed out loud as I imagined Ali's exaggerated comedy voice confessing life moments like this one when she was pregnant:After a while, I couldn't see my\nI truly feared this book would be fluff. Instead it is fearless and real. Ali Wong says how we all feel:  I'm not fine.  Yet in her resilience and grit she is able to turn childhood resentment, male rejection, discrimination, getting boo'd offstage, the fear of a prenup, and a bushy pussy into the best things that could have happened to her. I laughed out loud as I imagined Ali's exaggerated comedy voice confessing life moments like this one when she was pregnant:After a while, I couldn't see my vagina when I looked down, because all I could see was my belly. But when I stared at myself in the mirror, my vagina just looked like an ancient wise Chinese man from a fairy tale that got stuck in a cave and survived off yams. The hair was so damn long and neglected. My nipples became progressively bigger and darker. One day I noticed the tips were starting to look a little scaly and naturally rubbed them. Some bits started to flake off like tiny brown boogers. And I just sat on the bathroom floor completely naked, with a garbage can between my thighs, picking at my nipples. Daddy walked in on me while I was completely focused on this important activity and asked , \"Are you harvesting your nipples?\" I didn't even look at him and just responded, \"Well, obviously.\"So many times I said YES I totally get that. It wasn't just because we shared a common Asian experience but often because we shared a common human experience. I applaud her courage in sharing so nakedly (sometimes literally nakedly so be prepared for some frank language).  Asian women live forever and having kids is like a 401(k) for companionship YES If a man rejects you once you've physically made a move on him, he's not going to change his mind. The dick don't lie. YES What I have in common with stay-at-home moms: We are all just doing our best. YES I've felt an increasing amount of jealousy and resentment from certain white male comics... I hear that line a lot: 'Me, I'm just another white guy.' Here's a solution: Try being a funnier white guy. YES It broke my heart. I said, 'This is torture. I can't handle this anymore. ' YES The most important part of parenting, relationships, pretty much anything - is just actually being there. YESA friend and I worried because in the intro Ali tries to set our expectations low about her writing. But while her prose isn't exquisite in that way where you can rhapsodize over gloriously minute details, it is weighted with truth which far exceeded my expectations. 5 stars. P.S. I have a secret hope that Ali and I are meant to be good friends, for her sister is also named Mimi and her best friend has half my name Miya. But wait would that make me superfluous? I am not too proud to be a 3rd Mimi.*My honest review was made possible by an Advanced Reader Copy thanks to Random House.*\n...more"
            },
            "11": {
                "date": "Oct 20, 2019",
                "content": "Dear Ali Wong, it's not you, it's me. I saw an interview with you and thought you were funny. It turns out that your humour is not my humour. I'm really not picky when it comes to celebrity memoirs but this one was not for me."
            },
            "12": {
                "date": "Feb 23, 2020",
                "content": "Was laughing out loud in my car listening to this on my commute. If you like Ali's stand up comedy specials, this is the book for you!"
            },
            "13": {
                "date": "Oct 07, 2019",
                "content": "If any of you have enjoyed Ali Wong's stand-up, I'm sure you'll also enjoy this book. Brutal honesty, expose-all humor, and some heart mixed in with all the entrapment stuff that women are into. :)Of course, there's always a twist. This book is set up as a series of letters to her young daughters, but its kinda a gimmick. One that works, fortunately, by giving us a familiar outlet for her comedy. Some of the sets translate the same way from Baby Cobra or Hard Knock Wife and there's new material\nIf any of you have enjoyed Ali Wong's stand-up, I'm sure you'll also enjoy this book. Brutal honesty, expose-all humor, and some heart mixed in with all the entrapment stuff that women are into. :)Of course, there's always a twist. This book is set up as a series of letters to her young daughters, but its kinda a gimmick. One that works, fortunately, by giving us a familiar outlet for her comedy. Some of the sets translate the same way from Baby Cobra or Hard Knock Wife and there's new material here, too, but maybe not as much as some folks might expect. It's about as different from those two specials as the two specials are from each other. Is it a good way to get to know her as a comic? Would it be more fun to read this before watching her specials?I wouldn't know. I got this book on Netgalley and THEN watched the specials. By then I was already a fan so this is all bonus, baby.Have fun!\n...more"
            },
            "14": {
                "date": "Jul 26, 2019",
                "content": "(I got my hot little hands on an ARC from secret sources.) I really liked the book except for the last chapter from the author's husband, which ended up making me like the whole book less.First, the chapter was insipidly self-congratulatory and he is boring so I do not care what he has to say. Congratulations on being okay with being rich?Second, the rest of the book is so funny and vulgar - a lot like Ali Wong's standup - and suffused with so much love for the titular girls. There are so many\n(I got my hot little hands on an ARC from secret sources.) I really liked the book except for the last chapter from the author's husband, which ended up making me like the whole book less.First, the chapter was insipidly self-congratulatory and he is boring so I do not care what he has to say. Congratulations on being okay with being rich?Second, the rest of the book is so funny and vulgar - a lot like Ali Wong's standup - and suffused with so much love for the titular girls. There are so many extremely gross and hilarious stories about giving birth and babies and childcare...and then in the husband's chapter there's a brief throwaway mention of the girls' Ukrainian nanny who is not mentioned even once in the rest of the book and I was just like \"hmm\". Okay. So I get that if you are Ali Wong, discussing your nanny (who you were able to hire because, again, you're rich) disrupts the narrative that you're ~just like the rest of us~ with career insecurities and family struggles and whatever. And I understand that it's difficult to walk the line of maintaining the authentic, crassly down-to-earth voice that's made you famous but also now you're famous. Still, it really made me re-think the whole book, and the clearly strategic choice to leave out discussion of the nanny. Somewhere during the (many) paragraphs where she's lauding her husband for somehow managing to co-parent their children despite having a job, she couldn't have thrown in a little bit of gratitude for the woman whose job it is to care for their children? It left a bad taste in my mouth and I knocked off a star because of it.\n...more"
            },
            "15": {
                "date": "Dec 22, 2019",
                "content": "3.5 starsIn a series of letters to her two daughters (who she says cannot read the book until they're at least twenty-one), stand up comic Ali Wong provides unfiltered advice on topics like motherhood, sex, and marriage.  She shares stories from her childhood, her early days in standup, her dating life, and how she met her husband.While it's a hilariously raunchy memoir for readers, I love that it's basically a cautionary tale for her daughters full of experiences she hopes they will learn from\n3.5 starsIn a series of letters to her two daughters (who she says cannot read the book until they're at least twenty-one), stand up comic Ali Wong provides unfiltered advice on topics like motherhood, sex, and marriage.  She shares stories from her childhood, her early days in standup, her dating life, and how she met her husband.While it's a hilariously raunchy memoir for readers, I love that it's basically a cautionary tale for her daughters full of experiences she hopes they will learn from and full of the heartfelt wisdom and advice only a mother can give.This book is a light and entertaining read while also providing an important look at stereotypes of women (in comedy, as working mothers, as sexual beings, etc.) and Asian culture.  She covers sensitive topics like miscarriage and pregnancy complications with humor but also refreshing honesty and touches on both the anxiety of being employed in America while pregnant and of returning to work after giving birth.My favorite chapters were definitely those focusing directly on motherhood: \"The Miracle of Life\", \"Why I Went Back to Work\", and \"Bringing Up Bebes\".  So hilarious, embarrassing, and completely relatable.This is a great autobiography if you enjoy Wong's standup specials and/or roles in television or can appreciate hilariously honest but raunchy (seriously, prepare to blush a lot or gasp if you're the type to clutch your pearls) stories.For more reviews, visit www.rootsandreads.wordpress.com\n...more"
            },
            "16": {
                "date": "Jan 15, 2020",
                "content": "I really enjoyed this book. I laughed a lot, I cringed some, and teared up a bit during the afterward written by the authors husband. Definitely recommend!\nI really enjoyed this book. I laughed a lot, I cringed some, and teared up a bit during the afterward written by the author’s husband. Definitely recommend! \n...more"
            },
            "17": {
                "date": "Nov 13, 2019",
                "content": "4 StarsAli Wong is a force to be reckoned with. Her comedy is bawdy and no holds barred, often bordering on offensive when shes at her filthiest, but shes also so god damn genuine and unpretentious, completely unrepentant in the brutally honest way she talks about her relationships, sex, and the way she experiences the world around her.This memoir is delivered in a series of letters, written to her two little girls, offering personal stories and sharing her own unique advice and wisdom on topics\n4 StarsAli Wong is a force to be reckoned with. Her comedy is bawdy and no holds barred, often bordering on offensive when she’s at her filthiest, but she’s also so god damn genuine and unpretentious, completely unrepentant in the brutally honest way she talks about her relationships, sex, and the way she experiences the world around her.This memoir is delivered in a series of letters, written to her two little girls, offering personal stories and sharing her own unique advice and wisdom on topics of race, culture, relationships and motherhood. It’s funny as hell, but it’s equally honest and heartwarming, and maybe surprisingly (or unsurprisingly) insightful and thought-provoking. This was a good read made more enjoyable through the author narrated audiobook edition, which just added something extra to the experience having been read by Ali herself. If you find yourself interested in this book, I definitely recommend the audio — you can’t go wrong!\n...more"
            },
            "18": {
                "date": "Feb 08, 2020",
                "content": "Listen to this on audio because its so good. This book is great, gross, and generally gassy. Like Ali Wong has no filter. You get to her all about intimate details of her life and all the information she wants to pass onto her daughters. I was laughing at some parts and like oh my god too much information at others. Still, its really relatable when she talks about how gross being a parent is and like how you can use a c section as a way to get out of things. Haha. But seriously you just end up\nListen to this on audio because it’s so good. This book is great, gross, and generally gassy. Like Ali Wong has no filter. You get to her all about intimate details of her life and all the information she wants to pass onto her daughters. I was laughing at some parts and like oh my god too much information at others. Still, it’s really relatable when she talks about how gross being a parent is and like how you can use a c section as a way to get out of things. Haha. But seriously you just end up giving your baby Mac n cheese eventually so just stop worrying so much? Also, the afterword by her husband is amazing and made me emotional in a good way. Ali Wong is one of my favorite funny people, and this book just cements why. Recommend do fans of Wong and anyone who just wants a laugh.\n...more"
            },
            "19": {
                "date": "Feb 11, 2020",
                "content": "Some parts: GREATOther parts: What?Most parts: Meh."
            },
            "20": {
                "date": "Aug 25, 2019",
                "content": "Dear Ali Wong,I want to be your best friend.You made me laugh so hard and cry unexpectedly, separately and also simultaneously (and here is where I should insert the cry-laugh emoji). And you know why I felt what I felt? Because your voice really pierced through the pages. It was like watching you on stage in one of your Netflix stand-up specials, and sometimes even like you were addressing me personally. The content was similar to some of the themes of your specials but you poured your thoughts\nDear Ali Wong,I want to be your best friend.You made me laugh so hard and cry unexpectedly, separately and also simultaneously (and here is where I should insert the cry-laugh emoji). And you know why I felt what I felt? Because your voice really pierced through the pages. It was like watching you on stage in one of your Netflix stand-up specials, and sometimes even like you were addressing me personally. The content was similar to some of the themes of your specials but you poured your thoughts and emotions in this a lot more, since you were really addressing your girls and not me.You made me even prouder of my Asian heritage. To hear an empowered Asian person talk about her own experiences in our shared culture and tradition but also in the context of your unique life, provided me with so much appreciation and insight into my own. Beyond the Asian experience, it applies to many of us all - relationships, sexuality, marriage, family, workplace. And this is why representation matters. Because so many others of the same culture can relate to, but also these relatable human experiences are universal.Love you,Your new BFF\n...more"
            },
            "21": {
                "date": "Nov 08, 2019",
                "content": "I really hope Ali Wong's daughters never actually read this, or they're going to be horrified."
            },
            "22": {
                "date": "Jan 31, 2020",
                "content": "Not too much to say except I really loved this collection of essays by Ali Wong. I got to know a little bit more about her, her family, her husband, and how she started off in comedy. She manages to infuse her essays to her daughters with love, laughter, and sometimes tears. I did love how this collection ended with a letter from her husband to their daughters too. The family seems very tight-knit, slightly manic at times, but ready to pull a knife on you if you screw with one of their own.I\nNot too much to say except I really loved this collection of essays by Ali Wong. I got to know a little bit more about her, her family, her husband, and how she started off in comedy. She manages to infuse her essays to her daughters with love, laughter, and sometimes tears. I did love how this collection ended with a letter from her husband to their daughters too. The family seems very tight-knit, slightly manic at times, but ready to pull a knife on you if you screw with one of their own.I have to say that I found myself nodding along with Wong during parts of this essay to her daughters. I love what she had to say about marrying someone within their own culture and how it just makes things easier because you get things that someone else would not. I also loved her thoughts on traveling abroad to experience different people, countries, and food. All of the food mentioned in this book made me ridiculously hungry too by the way. When I traveled through Indonesia, Sri Lanka, and Hong Kong years ago it felt like I finally came home. I ate everything I could and just went for whatever was put in front of me. I finally found countries that actually cooked food so hot it made the heat travel up through my ears. I was in heaven. Wong of course goes into how she met her now husband, how things were not perfect, still are not perfect, but they loved each other. It's also wonderful to see how she handles being the \"breadmaker\" in the family while he does things that are typically assigned to women. I think in America we still have that problem with men that stay at home are looked down upon by not only other people, but within their own families. Somehow stay at home husbands are not manly enough or something. But we don't say a word about how women are not womenly enough if they stay at home.Wong's family sounds completely chaotic and I loved the stories about her parents, her sisters, and her brother. We also get such great insights into the comedy circuit and how she forced herself out there to play in front of audiences that were diverse in order to get better. If you just play in front of the same crowd of white men and women, how are you stretching yourself and growing?Definitely would love to read another book from her in the future. \n...more"
            },
            "23": {
                "date": "Dec 11, 2019",
                "content": "I'll be clapping my hands in front of my face all day from now on. *lol* And I'm proud to say that according to Ali Wong's guide, we went to a top-notch authentic Chinese restaurant when we were in NYC. *beams*No, this book is not a very deep work of literary art. That, however, doesn't mean that it's not great. The author has a very down-to-earth style that made me like her two stand-up comedy programs on Netflix so much and she's using it to talk about everything from dating and conceiving to\nI'll be clapping my hands in front of my face all day from now on. *lol* And I'm proud to say that according to Ali Wong's guide, we went to a top-notch authentic Chinese restaurant when we were in NYC. *beams*No, this book is not a very deep work of literary art. That, however, doesn't mean that it's not great. The author has a very down-to-earth style that made me like her two stand-up comedy programs on Netflix so much and she's using it to talk about everything from dating and conceiving to raising babies, stand-up comedy careers and her experiences in shitty places (such as NYC and Vietnam). She's unafraid to talk about slightly disgusting bodily fluids and sexual practices. And she does so in a very entertaining way.The book is written in the form of letters to her two daughters. If those girls ever read this book (they are still too young), I bet they will ... be eternally embarrassed while simultaneously being insanely proud of their mom. And rightfully so. Ali Wong does away with stupid taboo topics such as miscarriages as well as judgment and instead just tells it like it is. No sugarcoating things. Very refreshing.A short but very enjoyable look at everything from education to having your own family and juggling motherhood with a career on the road. The book wasn't as funny as the two shows I've seen, but it still made me laugh and I really liked the openness and unapologetic way she treated the topics in the book. \n...more"
            },
            "24": {
                "date": "Dec 27, 2019",
                "content": "This was a much more entertaining book than I thought it would be although I do feel like I should warn you that Ali has no filter whatsoever ;) if you are familiar with her work, maybe watched one of her Netflix specials, then you know what I am talking about if shes a new artist for you, then I would definitely recommend checking up her kind of humor online dont get me wrong, this book is so much more than just jokes and such, but when they appear they are well, definitely hers ;) besides\nThis was a much more entertaining book than I thought it would be… although I do feel like I should warn you that Ali has no filter whatsoever ;) if you are familiar with her work, maybe watched one of her Netflix specials, then you know what I am talking about… if she’s a new artist for you, then I would definitely recommend checking up her kind of humor online… don’t get me wrong, this book is so much more than just jokes and such, but when they appear they are… well, definitely hers ;) besides them, there are also a lot of her memories from being younger and her ways of dealing with life… all of those thoughts are put together as letters to her two daughters, teaching them all the things she thinks are important :) it was a good idea and since I listened to the audiobook version of this novel, and Ali herself narrated it, it was perfect ;) 4 solid stars and I can easily recommend it for you to at least give it a try ;)XOXOA\n...more"
            },
            "25": {
                "date": "Nov 14, 2019",
                "content": "Looking for a hilarious memoir to binge read? Look no further. I FLEW through Dear Girls, and laughed so hard while reading this hilarious novel by Ali Wong. To be honest, I havent seen many of the Netflix shows that she mentions, but after reading each chapter I feel that its my duty to binge watch them all now.Told with such hilarity and honesty, but also heartfelt as she explains everything to her two young girls from getting ready for a date, to childbirth and the rough days postpartum. I\nLooking for a hilarious memoir to binge read? Look no further. I FLEW through Dear Girls, and laughed so hard while reading this hilarious novel by Ali Wong. To be honest, I haven’t seen many of the Netflix shows that she mentions, but after reading each chapter I feel that it’s my duty to binge watch them all now.Told with such hilarity and honesty, but also heartfelt as she explains everything to her two young girls from getting ready for a date, to childbirth and the rough days postpartum. I loved it!*Thank you @randomhouse for this gifted copy for review. All opinions are my own.\n...more"
            },
            "26": {
                "date": "Oct 15, 2019",
                "content": "Many thanks to NetGalley, Random House Publishing Group, and Ali Wong for an ARC in exchange for an honest book review of Dear Girls. My thoughts and opinions are 100% my own and independent of receiving an advance copy.Stand up comedian, actress, and writer, Ali Wong can now add author to her list of accomplishments. You might recognize her from her Netflix specials Baby Cobra or Hard Knock Wife. Or maybe youve seen her Netflix movie Always Be My Maybe. The movie where the meme with Keanu\nMany thanks to NetGalley, Random House Publishing Group, and Ali Wong for an ARC in exchange for an honest book review of Dear Girls. My thoughts and opinions are 100% my own and independent of receiving an advance copy.Stand up comedian, actress, and writer, Ali Wong can now add author to her list of accomplishments. You might recognize her from her Netflix specials Baby Cobra or Hard Knock Wife. Or maybe you’ve seen her Netflix movie “Always Be My Maybe”. The movie where the meme with Keanu Reeves went viral. If you haven’t seen it, google it - and you’re welcome. She has written a book in the style of letters to her daughters. Each chapter has cute headings like “How I Trapped Your Father” and “A Guide To Asian Restaurants”. But if you think that she has toned down her language, she hasn’t. This is on brand Ali Wong. Be prepared for crass, dirty, vulgar style that she is known for. It is very similar to her stand up. If you enjoy her comedy routines you will love this book. If not, maybe watch a special before buying this one.I am a bit in the middle with this one. It was okay, there were some funny parts, some cringeworthy parts and some yawnable moments. You get some real moments, but not enough. It would have helped me feel more connected to the book had we had more realness. It seemed distant in some ways. I think if you love her humor, you will find lots to laugh at. I’m not in love with potty humour so sometimes I felt like really, again? I understand why she makes those choices, but I don’t like it in men any more than I do in women. I’m not offended that a woman is saying these things. I just am not a big fan. I was still left wanting more after reading this book. I don’t think you get to know her any better from the book, than what you see up on stage. She says herself the those are just caricatures of real people. So I felt like I was reading a caricature of Ali Wong. Not getting to really know her. The most personal moment in the book is the letter her husband writes in the afterwards. There are some funny parts, but it isn’t laugh out loud, hilarious all the way through. As I said, maybe her fans will really love it. Just okay for me.\n...more"
            },
            "27": {
                "date": "Dec 11, 2019",
                "content": "Dear Girls is a compilation of the letters written by an American actress, stand-up comedian, and writer Ali Wong to her young daughters Mari and Nikki. Her letters are about her life as a child and a teenager, her struggles as an aspiring stand-up comedian, advice for living best life, confessions, food, dating, education, family, how she met her husband and how much she is proud of her Vietnamese and Chinese heritage and hence requested her girls to read this book only when they turn 21 years\nDear Girls is a compilation of the letters written by an American actress, stand-up comedian, and writer Ali Wong to her young daughters Mari and Nikki. Her letters are about her life as a child and a teenager, her struggles as an aspiring stand-up comedian, advice for living best life, confessions, food, dating, education, family, how she met her husband and how much she is proud of her Vietnamese and Chinese heritage and hence requested her girls to read this book only when they turn 21 years old.Before Ali’s father passed away after battling cancer and depression he left a note in a sealed envelope for her which began with “Dear Alexandra”. She is very grateful for the letter her dad left but wished he had written more about himself. Hence she came up with an idea to write these letters for her daughters so that they will understand and know her better.All in all this book is hilarious, heartfelt, uncensored in most of the places and Ali Wong has fearlessly written everything about her life. You do not have to know her to read this book and you will become her admirer once you finish this one. I knew very little about her before I started reading this book and now I am her fan. This book is a must-have and is like her classic stand up comedy in written form which is the best laughter remedy for difficult days and will instantly elevate your mood.I recommend that every guy must read the last letter (chapter) of this book written by Ali Wong’s husband. It is so inspiring to see a person supporting his partner so selflessly. Here I am not saying that everyone should stop pursuing there career goals and it is not possible for everyone but supporting a little in our own way and as much as we can is so important in a relationship.Thank you Netgalley for the advance copy.\n...more"
            },
            "28": {
                "date": "Oct 17, 2019",
                "content": "I suspect this book would be a huge hit with parents of small children. For me, it was just okay. Also, since I didn't see any reviews mention this, TW for miscarriage and pregnancy complications."
            },
            "29": {
                "date": "Nov 19, 2019",
                "content": "OMG TMI DNFAs a fan of Ali Wong's comedy, I was looking forward to this audiobook. I was expecting something akin to a comedy performance. I was wrong. I found this book disgusting."
            }
        }
    },
    {
        "link": "https://www.goodreads.com/book/show/43885930-life-will-be-the-death-of-me?from_choice=true",
        "brand": "Life Will Be the Death of Me: . . . and You Too!",
        "isbn": 9780525511779,
        "reviews": {
            "0": {
                "date": "Apr 21, 2019",
                "content": "Loved her narration of the audiobookyou could hear the emotion in her voice. And I respect how vulnerable and real she was in this. Definitely not a book for everyone but I appreciated it and it was a good companion during my move and unpacking of many boxes.\nLoved her narration of the audiobook—you could hear the emotion in her voice. And I respect how vulnerable and real she was in this. Definitely not a book for everyone but I appreciated it and it was a good companion during my move and unpacking of many boxes.\n...more"
            },
            "1": {
                "date": "Mar 29, 2019",
                "content": "This was Chelsea's best-and most honest- memoir yet. Its still got that Chelsea brand of humor but she gets deep about privilege, politics, activism, drugs, family, and finding meaning in your life. It's really personal and probably won't appeal to every reader, but I enjoyed it. It made me think and made a great case for therapy being something for everyone. What...a delight."
            },
            "2": {
                "date": "Apr 15, 2019",
                "content": "This was a very big departure from the type of books Chelsea normally writes. It still had flashes of her humor (which I love), but it was pretty serious. It was mostly about her dealing with the death of her brother and mom, and then realizing her shortcomings and wanting to be a better person.It was good, and I will always be a huge fan of hers, but if you're looking to laugh, this is not the book."
            },
            "3": {
                "date": "May 29, 2019",
                "content": "I didn't properly read reviews before starting the audiobook of Life Will Be the Death of Me: . . . and You Too!, and I expected it to be another outrageous, funny, anecdotal book from Chelsea Handler. That's not at all what I got. This book is a deep, introspective look at Chelsea Handler's life, shortcomings, and personality traits that make up the complex person that she is today. It is a serious story, and it's told very movingly and with much more vulnerability than I would have though\nI didn't properly read reviews before starting the audiobook of Life Will Be the Death of Me: . . . and You Too!, and I expected it to be another outrageous, funny, anecdotal book from Chelsea Handler. That's not at all what I got. This book is a deep, introspective look at Chelsea Handler's life, shortcomings, and personality traits that make up the complex person that she is today. It is a serious story, and it's told very movingly and with much more vulnerability than I would have though Chelsea Handler to be capable of. If you have the chance to listen to this book in audio format, take it. I couldn't stop listening to Chelsea's voice, which ranges in tone from brazen to outraged to quivering with raw emotion. During the very meaty parts of the story, Chelsea is just opening crying while she reads. It was very enlightening listening experience for me. The story feels like a train of thought that never ends. It is like one long, gutting therapy session (at times, it is literally that). It humanized Chelsea Handler for me, who previously seemed chiefly just bawdy and tough. When I described the gist of the book to my husband, his immediate reaction was, Why would anyone listen to that? I'll admit, it's hard to describe the appeal of reading about a woman in her 40s examining her privilege, learning empathy for the first time, and digging deep into the reasons she is the way that she is. However, I found the audiobook to be addictive in a serious, contemplative way, and I had a hard time pressing pause. Go into this book looking for something different, not something funny or particularly entertaining. I found it to be a very worthwhile listening experience, and I know I'll be thinking about Chelsea Handler in a new light from now on. goodreads|instagram|twitter|blog\n...more"
            },
            "4": {
                "date": "Nov 04, 2019",
                "content": "Chelsea HandlerChelsea Handler is an American comic, actress, writer, television host, producer, and activist. Chelsea's a funny gal, but she takes a serious look at her life in this book - written as a result of a mid-life crisis triggered by Donald Trump's election. \"The news was giving me diarrhea\", Chelsea writes. \"The whole administration was giving me diarrhea. My outrage was high.\" Chelsea had a mid-life crisis after Trump's electionChelsea excoriates Trump as well as 'vampiric Ivanka and\nChelsea HandlerChelsea Handler is an American comic, actress, writer, television host, producer, and activist. Chelsea's a funny gal, but she takes a serious look at her life in this book - written as a result of a mid-life crisis triggered by Donald Trump's election. \"The news was giving me diarrhea\", Chelsea writes. \"The whole administration was giving me diarrhea. My outrage was high.\" Chelsea had a mid-life crisis after Trump's electionChelsea excoriates Trump as well as 'vampiric Ivanka and Jared', and 'Sarah Suckabee Sanders.' Chelsea is especially offended by the women in the Trump administration who do a disservice to their own gender.Chelsea acknowledges that she herself had a favored, successful life. Talented, pretty, Jewish, and driven, young Chelsea went to Hollywood and scored roles in movies and television before getting her own shows on E! and then Netflix. Teen Chelsea Handler was talented and prettyNevertheless, at the age of 42 Chelsea felt that something about her life was off, and - following Trump's ascendancy - decided to get therapy. Thus, Chelsea started seeing 'a real psychiatrist', Dr. Dan Siegel.Chelsea Handler's psychiatrist, Dr. Dan SiegelChelsea goes into detail about her therapy with Dan and recreates many of her conversations with the analyst. These sections are interspersed with anecdotes about Chelsea's life, some serious and some funny. At Dan's suggestion, Chelsea took the Enneagram personality test, which shows you which of nine personality categories you fit into. Chelsea decided she was a type 8 personality. \"Eights are self-confident, strong, assertive, protective, resourceful, straight-talking, and decisive, but they can also be ego-centric and domineering. Eights typically have problems with their tempers and with allowing themselves to be vulnerable. At their Best: eights use their strength to improve others' lives, becoming heroic, magnanimous, and inspiring.\" At their worst, eights are sociopaths. Chelsea observes that her dad and Donald Trump are also type 8 (I guess with Trump being on the sociopathic end of the scale.) Chelsea notes: \"The best way to describe my father is that he's a lot like Donald Trump but less successful, thank God, otherwise the damage he could have unleashed on innocent people could have been more widespread. Small Chelsea Handler and her father Melvin Chelsea calls her dad a 'shyster' and observes - not quite jokingly - that he sexually harassed all the black and Latina women in his orbit. During her analysis with Dan, Chelsea's epiphany comes when she realizes she hasn't properly dealt with the two biggest tragedies in her life: the death of her oldest brother Chet from a disastrous fall, and the death of her mother from cancer. Chelsea writes, \"My brother was the first man I ever slept with. The night I came home from the hospital my mom said that Chet, who was 13 at the time, asked if he could sleep with me....to which my mom agreed.\" Protective Chet had a rough night, though, since he worried about rolling over and crushing a two-day-old baby.Chelsea asserts, \"This gives you some insight into how interested my parents [Melvin and Rita Handler] were in raising children, or for that matter in using protection. They had 6 children and it's a miracle any of us are still breathing.\" Not to give the wrong impression, the Handlers loved their children, but had a laissez-faire attitude about rearing them. For instance, when pre-teen Chelsea walked into the house with a case of beer 'to try out', Rita just shrugged it off.Chelsea Handler's parents, Melvin and RitaChelsea adored her brother Chet. He would pull her from the covers and swing her in a circle; drive her around and let her listen to music; and take her sailing. On boating jaunts with his siblings, Chet always upset the skiff, dropping everyone in the water and making them laugh hysterically. Chelsea Handler's brother ChetWhen Chelsea was 9 and Chet was 22, the family - who lived in New Jersey - planned a trip to their vacation cottage in Martha's Vineyard. Chet decided to go hiking first, at the Grand Canyon, Zion Canyon, and then the Grand Tetons. Chelsea fussed, but Chet promised he'd come home in a couple of weeks and join the family. He never did. Grand Teton National Park in WyomingChet fell down a mountain in the Grand Tetons, and was killed. On top of her intense grief and sorrow Chelsea worried about the optics. \"Now everyone would know for sure our family was broken because now our family really WAS broken. We were already skating on thin ice because my parents were known to be less than traditional and a little bit too lackadaisical.....and now we had a dead brother because my parents let their son go hiking in the Grand Tetons and he had never hiked a mountain like that before. They were unfit, and now there was proof.\"Young Chelsea HandlerChelsea was bereft, and part of her continued to wait for Chet to return because he had promised he would. Moreover, the members of Chelsea's family withdrew into themselves, and she received no counseling or therapy. Thus, Chelsea's despair was locked up for decades, and deepened by her mother's illness. Chelsea Handler and her mother RitaChelsea's mom Rita had several bouts with cancer. During Rita's final illness, when Chelsea was about 30, her dad Melvin was useless. Melvin just mooned around the hospital and went out to get himself food. Meanwhile, Chelsea raised hell about her mother being in a hospital room with a smoker, and harassed the nurses for more pain meds for her mom. In accordance with her type 8 personality, Chelsea stepped up, as she ALWAYS did as an adult. Chelsea observes, \"There are things you can do for other people that you could never do for yourself. Whenever I have trouble standing up for myself.....and yes it has happened.....I think about whether I would tolerate the situation if it were happening to one of my sisters, mother, daughter, or niece. If it's not acceptable for them, it's not acceptable for me.\" Sadly, Chelsea's mother succumbed to the disease, adding to the comic's distress. Chelsea's therapy helped her work through the emotional impasse caused by her brother and mother's deaths.During her analysis with Dan, Chelsea also learned that - though she was good at sympathy - she lacked empathy. Chelsea couldn't understand the feelings of others, and had to work with Dan to overcome this flaw. In the end, Chelsea made a documentary about white privilege; began to respect other people's feelings; came to comprehend other peoples' limits and boundaries; learned more about the ubiquity of sexual harassment; and so on.On the lighter side, Chelsea talks about her cherished pets, an assortment of chow mix rescue pooches.\"Loving a dog makes you a kinder and fuller person\" Chelsea says. Her 'first born' was Chunk, a regal hound who accompanied Chelsea to work and on her travels. Chelsea Handler and ChunkThen came Tammy, who'd survived more than one street fight and showed it. \"Tammy had one dead ear, alopecia on her ass, a very scantily clad tail, and a gait that hinted she had sustained hip replacement surgery.\" Chelsea remarks, \"I knew that with some maternal attention from my cleaning ladies and some serious nutrition I could turn that gait into a swagger.\" Chelsea Handler and TammyTammy (reluctantly) endured Chelsea's aggressive love for years until she went to doggie heaven. After Tammy's demise, Chelsea got two more chow mixes, a brother and sister called Bert and Bernice. Chelsea Handler with Bert and BerniceTales about these two, especially Bert, are hilarious. Chelsea observes, \"Burt has all the trappings I look for in a pet: long hair, weight management issues and laziness behind the eyes. Bert is slow on the uptake and is constantly confused by the same things he has done moments before. His memory is so short term that if I'm gone for a few hours, I have to re-introduce myself every time I come home. The dirty looks he throws my way when I try to gain re-entry into his world are so full of disdain that sometimes I don't even have the stomach for it.\" Though Bert dismisses Chelsea's attempts at affection, he's smitten with Chelsea's Mexican housekeeper Mama and follows her everywhere. If Mama strolls away swinging her behind, Bert is right behind doing the same thing. Chelsea admits that, when Bert hides under the table, she tricks him into coming out by using a Mexican accent. To add insult to injury, Bert's sister Bernice plays dead when Chelsea approaches.When Bert had to go on veterinarian-ordered diet, Chelsea came home after being away for five days and found Bert and Mama strutting around the house, both wearing ankle weights - two for Mama and four for Bert. Chelsea laments, \"Bert and Mama had started their very own weight loss challenge and guess who didn't get the group text.\" In another dog story, Chelsea writes about giving Chunk human sedatives during a plane trip, a mistake that resulted in one calamity after another. (It's a wonder the duo were ever allowed on an aircraft again. 😊 ) Chelsea Handler and Chunk on a planeIn other vignettes, Chelsea talks about her technological ignorance; her attraction to hunky Robert Mueller; a journey to Peru to take the hallucinogenic drug ayahuasca; the (inadvertently amusing) problems associated with burying her Mormon mother in a Jewish cemetery; her father's bypass surgery; her father's death; her marijuana expertise; and more. Chelsea Handler with her father MelvinChelsea winds up by detailing 'The year I became me.' In the end, Chelsea put her money where her mouth is, gave up her Netflix show, and went out to get more women elected. Chelsea Handler announced she was leaving her Netflix showThe book is worth reading, both to learn about Chelsea's healing journey, and to her enjoy her wit and humor.You can follow my reviews at https://reviewsbybarbsaffer.blogspot....\n...more"
            },
            "5": {
                "date": "Aug 20, 2019",
                "content": "I wouldn't say I'm a Chelsea Handler fan because I rarely watched her show on E! and have yet to check out anything she has put out on Netflix. I do however, love her books. Her first four books literally had me in tears I was laughing so hard. (Her fifth book, Uganda Be Kidding Me, wasn't quite as good as the others but it still was pretty funny) This book is definitely different than anything she was written before as we get to see a more introspective and serious side of Chelsea.Chelsea's\nI wouldn't say I'm a Chelsea Handler fan because I rarely watched her show on E! and have yet to check out anything she has put out on Netflix. I do however, love her books. Her first four books literally had me in tears I was laughing so hard. (Her fifth book, Uganda Be Kidding Me, wasn't quite as good as the others but it still was pretty funny) This book is definitely different than anything she was written before as we get to see a more introspective and serious side of Chelsea.Chelsea's older brother died when she was nine years old. In this book she explores the impact of his death with her psychiatrist. She also talks about Donald Trump, her attraction to Robert Mueller, and how she is more interested these days to use her voice for something more meaningful. And of course it wouldn't be a Chelsea book if she didn't talk about her dogs. Even though this wasn't a laugh out loud type of book, I actually respect the fact she went with something different here. I think this book does reflect the changes in how she views herself, her family, and the world in general now that she is in her 40s. You might not be getting Chelsea the Entertainer in this one, but more Chelsea the Human Being. And that's not necessarily a bad thing because she's pretty interesting too!\n...more"
            },
            "6": {
                "date": "Apr 16, 2019",
                "content": "In an effort to burst her privileged bubble, Handler, with the aid of her brilliant, unflagging therapist, unearths who she is and why. After suffering a significant loss as a child, her already awkward family shifted. This memoir is a departure from her humorous essays, and while the wit is certainly still there, this is some heavy shit. I appreciate her openness. The way her pieces came together made sense. Its never too late to work on yourself; youre worth it. I should probably be in\nIn an effort to burst her privileged bubble, Handler, with the aid of her brilliant, unflagging therapist, unearths who she is and why. After suffering a significant loss as a child, her already awkward family shifted. This memoir is a departure from her humorous essays, and while the wit is certainly still there, this is some heavy shit. I appreciate her openness. The way her pieces came together made sense. It’s never too late to work on yourself; you’re worth it. I should probably be in therapy, tbh.\n...more"
            },
            "7": {
                "date": "Mar 04, 2020",
                "content": "4 stars Went into this based on a recommendation from a friend. I went into this book pretty much blind, Ive never read a Chelsea Handler book before so I didnt know what to expect. I definitely didnt expect a very in depth look at herself, how she was raised and the death of her brother. I came out of this book with a new found respect for Handler, she overcame a lot in life. And then when she was at the top, recognized she got to where she was because of her white privilege and is working\n 4 stars Went into this based on a recommendation from a friend. I went into this book pretty much blind, I’ve never read a Chelsea Handler book before so I didn’t know what to expect. I definitely didn’t expect a very in depth look at herself, how she was raised and the death of her brother. I came out of this book with a new found respect for Handler, she overcame a lot in life. And then when she was at the top, recognized she got to where she was because of her white privilege and is working hard to change that and helps others without the same privileges she had.Glad I listened, definitely a book I can see recommending to other people in the future.\n...more"
            },
            "8": {
                "date": "Jan 02, 2020",
                "content": "Find all of my reviews at: http://52bookminimum.blogspot.com/Confession: Chelsea Handler has a voice I want to punch in the face so Ive never been able to watch her on television. Despite this auditory issue, I have somehow managed to become quite the fan when it comes to her books. (I always tried to hear her doppelgänger, Elizabeth Banks, in my head instead when I read them.) Lord knows why I decided to give this one a listen, but it probably didn't help my rating any *shrug*I thought this was\nFind all of my reviews at: http://52bookminimum.blogspot.com/Confession: Chelsea Handler has a voice I want to punch in the face so I’ve never been able to watch her on television. Despite this auditory issue, I have somehow managed to become quite the fan when it comes to her books. (I always tried to hear her doppelgänger, Elizabeth Banks, in my head instead when I read them.) Lord knows why I decided to give this one a listen, but it probably didn't help my rating any *shrug*I thought this was going to be a hilarious take on a spoiled celebrity reevaluating her life and re-learning how to take care of some of the simple things without paid assistants. What I got instead was a real downer of a story that focused A LOT on death. \n\nThis is the second Handler book in a row that has missed the mark for me – maybe she’s out of memoir material? \n...more"
            },
            "9": {
                "date": "Jan 21, 2020",
                "content": "5 StarsIve spent the past 3 days oscillating between giving this a four- or five-star rating. Ive ultimately decided to go with the full five-stars, simply because I was so damn impressed by this whole memoir, not only in terms of content and execution, but also in terms of the extremely honest and raw narration Chelsea Handler delivered on the audio edition.Now, granted, Ive never read one of Chelseas books before, nor have I watched any of her shows or seen her stand-up performances, so I have\n5 StarsI’ve spent the past 3 days oscillating between giving this a four- or five-star rating. I’ve ultimately decided to go with the full five-stars, simply because I was so damn impressed by this whole memoir, not only in terms of content and execution, but also in terms of the extremely honest and raw narration Chelsea Handler delivered on the audio edition.Now, granted, I’ve never read one of Chelsea’s books before, nor have I watched any of her shows or seen her stand-up performances, so I have nothing to compare this to. Up until now, to me, she was just this opinionated, no-holds-bar, American comedienne – one I was fairly sure I only really knew about because she was friends with Jennifer Aniston and had some strong-ass opinions on Donald Trump’s presidency.So, how did I get here? I became intrigued by Chelsea’s story after listening to her and her sister (Shoshanna) guest star on Kate and Oliver Hudson’s podcast, Sibling Revelry, where they deep-dived into their childhoods, discussing their relationships with each other and their often-complicated relationships with their parents. I was so fascinated by what they had to say and how insightful and self-aware they seemed to be while saying it, that I couldn’t help but be compelled to read this memoir.Here, Chelsea shares everything, from accounts of hilarious travel adventures and anecdotes of her rescue dogs getting up to all sorts, through to the personality impacting, decades-old death of a worshipped older brother and her (sometimes messy) relationships with each of her parents. All of this she tells through the lens of her recent sessions with her psychiatrist, Dr. Dan Siegel, which just added to the originality of the memoir. As I mentioned, this was an extremely honest and raw narration, with Chelsea even breaking down and crying through several points of this emotional and astute self-reflection. Yet, through all the emotional stuff, Chelsea still delivered her trademark sardonic sense of humour and provided an amusing, authentic glimpse into her complex psyche.Needless to say, Chelsea Handler is on my radar now, in a whole new way, and I look forward to exploring more of her work going forward. \n...more"
            },
            "10": {
                "date": "May 06, 2019",
                "content": "This was quite a bit more serious than I expected, but definitely Handler's best book so far. If you're looking for fluff, this isn't it, but Handler does, of course, pack in her signature acerbic humor, even when she talks about far more serious stories of her life than in previous books. Entertaining and surprisingly moving at times!Find more reviews and bookish fun at http://www.princessandpen.com"
            },
            "11": {
                "date": "May 16, 2019",
                "content": "Plunged into a full-bodied Blue State despair by the election of Donald Trump, comedienne and talk show host Chelsea Handler takes her privileged self off to therapy to discuss, among other things, privilege, gender and, eventually, the deep-seated rage and fear that informs most of her choice-making. In a candid (if scattershot) examination of her childhood, she unearths the long-reaching effect of the death of her brother on her intimate relationships, her professional goals, and the framework\nPlunged into a full-bodied Blue State despair by the election of Donald Trump, comedienne and talk show host Chelsea Handler takes her privileged self off to therapy to discuss, among other things, privilege, gender and, eventually, the deep-seated rage and fear that informs most of her choice-making. In a candid (if scattershot) examination of her childhood, she unearths the long-reaching effect of the death of her brother on her intimate relationships, her professional goals, and the framework of her value system.Handler is an extraordinarily frank woman; she's made quite the fortune on this trait. It would be a mistake, however, to imagine that makes her self-reflective. This is probably her first experience with introspection and the insights she comes away with are start-of-the-journey affairs. Coupled, of course, with the requisite dose of wacky asides and outrageous behavior.At a tidy two-hundred thirty-nine pages, it will fill an afternoon with chat and the occasional therapeutic chit. Above all else, an entertaining read.\n...more"
            },
            "12": {
                "date": "Jul 19, 2019",
                "content": "I must confess a few thingsI have always liked Chelsea Handler. I have enjoyed both her television shows and her books. I have seen her stand-up comedy show live and I have even met her.She has always had a dark edge to her and the ability to say what is on her mind, something which I have always envied just a little bit. She has always appeared to me as sarcastically scary, if that is a real thing.But in this new book, Life Will Be the Death of Me, a new woman has emerged. One which I must say\nI must confess a few things…I have always liked Chelsea Handler. I have enjoyed both her television shows and her books. I have seen her stand-up comedy show live and I have even met her.She has always had a dark edge to her and the ability to say what is on her mind, something which I have always envied just a little bit. She has always appeared to me as sarcastically scary, if that is a real thing.But in this new book, Life Will Be the Death of Me, a new woman has emerged. One which I must say sounds (at the age of 42ish) all grown up!After the 2016 election of Donald Trump, Handler basically fell apart. But she had no idea why. During her recent Netflix series, Chelsea, she interviewed a psychiatrist, Dan Siegel and decided to make him her therapist. Thus began her year long self-analysis journey into why she is the Chelsea Handler she has been.Although the book covers serious subject matter, Handler does add her flair for the one liners, sarcasm and hysterical observations.One such story is how she became to have a crush on Robert Mueller! She knows he’s married!Through her analysis she primarily learns that she has never really gotten over her brother Chet’s sudden death when she was very young and because she never fully accepted the death, she has had many unattainable relationship goals as well as significant issues when dealing with death. Chet’s death impacted her whole immediate family and each sibling and parent dealt with it very differently, something a young girl at the time was hardly able to understand.Life Will Be the Death of Me is a quick read filled with humor, sadness, love and a message to everyone who has had to go through what she has had to. I have to say after reading this memoir it only makes me admire her more, and she doesn’t seem quite as scary.\n...more"
            },
            "13": {
                "date": "Jun 11, 2019",
                "content": "4.5 starsHeartfelt and heartwarming are two words I would not normally associate with Chelsea Handler, but as she takes the audience through some of her most painful past moments, thankfully using plenty of humor along the way, I found myself absolutely enraptured. This was really vulnerable of Handler to put herself on display in this particular way and it resonated and turned on a light to some of my own behaviors. Overall very well done and absolutely worth a listen."
            },
            "14": {
                "date": "Apr 16, 2019",
                "content": "I just can't read another book about a celebrity being depressed after the 2016 election - I'm not saying I didn't feel the same.. it's just too much at this point IMO."
            },
            "15": {
                "date": "Oct 22, 2019",
                "content": "This is my first Chelsea Handler book and Im so pleased I picked this one. I laughed, I cried and I laughed some more. I had no real expectations for this one and I think thats what made it even better. \nThis is my first Chelsea Handler book and I´m so pleased I picked this one. I laughed, I cried and I laughed some more. I had no real expectations for this one and I think that´s what made it even better. \n...more"
            },
            "16": {
                "date": "May 24, 2019",
                "content": "This Chelsea Handler book is different from her others but I loved it even more for that reason. She tackles so many serious matters and expresses her concerns and thoughts extremely well. She showed a much deeper and more intelligent side to herself in this one. I have read her other books and knew she was kinder than people would assume but this is really shown even more so in this book. I really incredible read."
            },
            "17": {
                "date": "Oct 29, 2019",
                "content": "Chelsea Handler has always been my go-to when Im looking for a laugh. Ive never read any books by her though, and I was looking for a genre mix up from the spooky reads this season. Life Will Be the Death of Me was such a delight!I had so many laugh-out-loud moments, and my favorite chapters were Chunk, Ayahuasca, and Marijuana Keeps Families Together. Told from her life with honesty and hilarity, Chelsea Handler serves up political views on Trump, race, antics from her dysfunctional family, and\nChelsea Handler has always been my go-to when I’m looking for a laugh. I’ve never read any books by her though, and I was looking for a genre mix up from the spooky reads this season. Life Will Be the Death of Me was such a delight!I had so many laugh-out-loud moments, and my favorite chapters were Chunk, Ayahuasca, and Marijuana Keeps Families Together. Told from her life with honesty and hilarity, Chelsea Handler serves up political views on Trump, race, antics from her dysfunctional family, and her affinity for drugs, alcohol, and chow-chows.*As a bonus I also listened on audio, and it was fabulous, and I highly recommend!\n...more"
            },
            "18": {
                "date": "Aug 04, 2019",
                "content": "3.5 Stars I love Chelseas books. Are you there Vodka? Its me, Chelsea is one of my fave nonfiction reads. But this one was so different! It had so much depth. She talked about politics, her white privilege, racism and just how she needed to do more self reflecting and try harder to become a better person. Oh and it also had the Chelsea humor. Im glad I got a chance to read it.There was a time when being famous and having this kind of success and money and having a tv show was what drove me to\n3.5 Stars I love Chelsea’s books. Are you there Vodka? It’s me, Chelsea is one of my fave nonfiction reads. But this one was so different! It had so much depth. She talked about politics, her “white privilege”, racism and just how she needed to do more self reflecting and try harder to become a better person. Oh and it also had the Chelsea humor. I’m glad I got a chance to read it.“There was a time when being famous and having this kind of success and money and having a tv show was what drove me to want more and more and more, and now I found myself exhausted and ashamed by the meaninglessness of it all.”This quote pretty much sums up this book.\n...more"
            },
            "19": {
                "date": "Apr 15, 2019",
                "content": "I stopped reading at paragraph 2 when she makes reference to her 2 assistants."
            },
            "20": {
                "date": "Apr 15, 2019",
                "content": "I've read all of Chelsea Handler's books, and this one was by far the poignant but also the most real. The humor I've come to know and love from her books is present, but she also tackles much more serious topics as the death of her brother when she was nine and her lifelong struggles with trusting those around her not to abandon her.Much of the book is told through her interactions with her therapist as she makes discoveries about herself and who she is. Life Will be the Death of Me felt much\nI've read all of Chelsea Handler's books, and this one was by far the poignant but also the most real. The humor I've come to know and love from her books is present, but she also tackles much more serious topics as the death of her brother when she was nine and her lifelong struggles with trusting those around her not to abandon her.Much of the book is told through her interactions with her therapist as she makes discoveries about herself and who she is. Life Will be the Death of Me felt much more like a memoir and a turning of chapter's in Chelsea's life. I enjoyed it in a different way from her other books- I wasn't hysterically laughing quite as often, but I felt more connections to her story.\n...more"
            },
            "21": {
                "date": "Jul 16, 2019",
                "content": "Life Will be the Death of Me...and You Too!   I Picked Up This Book Because:  I love Chelsea.Ive always thought Chelsea was an open book when it came to her writing but this book take open, honest and vulnerable to new levels for her. This book follows a year of therapy and explores her losses in life. Her personality, the shortcomings that come with that and her need and ability to overcome these challenges. This book was deeply personal on another level for Chelsea. I admire her for putting\n\n\nLife Will be the Death of Me...and You Too!\n\n\nI Picked Up This Book Because:\n I love Chelsea.I’ve always thought Chelsea was an open book when it came to her writing but this book take open, honest and vulnerable to new levels for her. This book follows a year of therapy and explores her losses in life. Her personality, the shortcomings that come with that and her need and ability to overcome these challenges. This book was deeply personal on another level for Chelsea. I admire her for putting it all out there. It’s not always pretty but I’m glad to see how open and honest she is about this journey. It has inspired me. \nThe Random Thoughts:\n  \nThe Score Card:\n5 Stars\n...more"
            },
            "22": {
                "date": "Apr 07, 2019",
                "content": "Read this in one evening. Its so Chelsea- which I love- brutally honest, charming and snarky- but she also opens up about some really tough topics, like the death of her brother and the loss of her parents, which is a side you rarely see from her. She brings up a lot of good points about the culture of endulgence and why we think bigger is always better. She catalogs many sessions with her therapist who asks her deep questions that had me feeling like I wanted go open up to someone too. Thank\nRead this in one evening. It’s so Chelsea- which I love- brutally honest, charming and snarky- but she also opens up about some really tough topics, like the death of her brother and the loss of her parents, which is a side you rarely see from her. She brings up a lot of good points about the culture of endulgence and why we think bigger is always better. She catalogs many sessions with her therapist who asks her deep questions that had me feeling like I wanted go open up to someone too. Thank you randomhouse #partner for my free copy. All opinions are my own. \n...more"
            },
            "23": {
                "date": "Jun 25, 2019",
                "content": "I couldn't put this book down. I would highly recommend you listen to the audiobook. Chelsea's narration was vulnerable and real. I laughed and I cried through this entire thing. 5 strong stats."
            },
            "24": {
                "date": "Feb 18, 2020",
                "content": "This was ok. I felt like there were good parts and not so good parts. The book was pretty disjointed with really sad bits mixed in with funny bits. Plus, there were parts that were supposed to be funny, but were trying too hard and missed the mark. At times it was a little repetitive. Mostly, it felt like sitting in therapy with her. Therapeutically, it was interesting. I'm not sure she knew where she was going with this book and it ended up being part memoir and part humor which never really\nThis was ok. I felt like there were good parts and not so good parts. The book was pretty disjointed with really sad bits mixed in with funny bits. Plus, there were parts that were supposed to be funny, but were trying too hard and missed the mark. At times it was a little repetitive. Mostly, it felt like sitting in therapy with her. Therapeutically, it was interesting. I'm not sure she knew where she was going with this book and it ended up being part memoir and part humor which never really meshed. Still, it turned out to be a decent read. \n...more"
            },
            "25": {
                "date": "Sep 09, 2019",
                "content": "4.5 stars. This was really excellent and not at all what I expected. I'd never read one of Chelsea Handler's books, and I expected this to be a lot funnier than it was. And it certainly has funny moments, but this is not a comedy book. It's a really tender, heartfelt memoir about pain and grief and really examining oneself. Through interactions with her therapist, Chelsea digs into some of the moments in her past that have affected her life the most, chiefly the death of her brother. She also\n4.5 stars. This was really excellent and not at all what I expected. I'd never read one of Chelsea Handler's books, and I expected this to be a lot funnier than it was. And it certainly has funny moments, but this is not a comedy book. It's a really tender, heartfelt memoir about pain and grief and really examining oneself. Through interactions with her therapist, Chelsea digs into some of the moments in her past that have affected her life the most, chiefly the death of her brother. She also talks about how devastating Trump's election, which I think is something a lot of us can relate to. I loved how vulnerable this book was, and it made me think a lot about my own life as well. Highly recommend the audiobook in particular, the narration really brings out the emotion in a lot of the subject matter.\n...more"
            },
            "26": {
                "date": "Apr 28, 2019",
                "content": "I miss Chelsea Handler's Netflix show, but this book explains why she quit. Lots of introspection from someone who doesn't seem accustomed to it. A few humorous stories about her dogs, but mostly serious essays about therapy. I like the acronym her therapist uses -- IAM: Identification. Awareness. Modification. And I am (no pun intended) curious about Enneagrams. I don't think I'm an 8, even though I identify with Chelsea and her journey (a word she hates, and I do too!) more than I expected to."
            },
            "27": {
                "date": "Jun 18, 2019",
                "content": "Listen to this book instead of reading it in paper form. You might be able to hear her voice come across in your head while reading the words but you won't hear her voice breaking at the moments that count and know how difficult it was for her to put this piece of work out there. Her journey to self discovery is so truthful and raw. When I realized that she not only had to live it, then write it, then narrate the story of her life and loss, I found myself tearing up too. Tears of sorrow for her\nListen to this book instead of reading it in paper form. You might be able to hear her voice come across in your head while reading the words but you won't hear her voice breaking at the moments that count and know how difficult it was for her to put this piece of work out there. Her journey to self discovery is so truthful and raw. When I realized that she not only had to live it, then write it, then narrate the story of her life and loss, I found myself tearing up too. Tears of sorrow for her loss and lack of empathy but also tears of joy for her discovery of the depths of emotion. I've loved watching her evolve from comedian to talk show/dinner party host to her current war for the electorate to be reflected with a more representative looking/talking/acting leaders. She is fierce and curious and honest almost to a fault. I hope she finds the growth and peace she is working for because she deserves it. It's never to late to try to be a better human.\n...more"
            },
            "28": {
                "date": "Jan 16, 2020",
                "content": "This is my favorite Chelsea Handler book. She gets real about her own life and it actually makes you think about your own choices and trauma. It's not very comedic which is strange from Chelsea, but it's okay because this book really makes you self reflect."
            },
            "29": {
                "date": "May 31, 2019",
                "content": "4.5 stars rounding up. I like Chelsea Handler though she can be a bit \"much\" at times... but this memoir is surprisingly honest, self-aware, and not the least bit raunchy/rude/inappropriate (those things are all fine, in certain circumstances). Unexpectedly insightful and moving, and I was fascinated by her childhood. Better yet I listened on audiobook and she is an excellent narrator. If you have even the slightest passing interest in Chelsea Handler, I wholly recommend this."
            }
        }
    },
    {
        "link": "https://www.goodreads.com/book/show/42060068-william-shakespeare-s-much-ado-about-mean-girls?from_choice=true",
        "brand": "William Shakespeare's Much Ado About Mean Girls",
        "isbn": 9781683691174,
        "reviews": {
            "0": {
                "date": "May 03, 2019",
                "content": "Hilarious! Shakespearean language is the perfect fit for Mean Girls. I've often fantasized of iambic pentameter returning to fashion. These Quirk Book mashups may be as close as it gets, but I'm not disappointed. Like Shakespeare, it's best to experience this performed and I have to say the full cast audiobook nails it. The only way to read this book, in my opinion.If it seems like a gimmick, it is, but a really really really well-done gimmick. I like that some original Shakespeare is peppered\nHilarious! Shakespearean language is the perfect fit for Mean Girls. I've often fantasized of iambic pentameter returning to fashion. These Quirk Book mashups may be as close as it gets, but I'm not disappointed. Like Shakespeare, it's best to experience this performed and I have to say the full cast audiobook nails it. The only way to read this book, in my opinion.If it seems like a gimmick, it is, but a really really really well-done gimmick. I like that some original Shakespeare is peppered into the lines to demonstrate their endless relevance. Many artists have interacted with Shakespeare in playful, modern ways, but I don't know of anyone else who's fully tried to mimmick the bard's own writing. Doescher does it masterfully, giving us literary nerds all the inside joke humor we could dream of while also crafting some truly deep, moving lines. Well done! Can't wait for his next mashup, MacTrump, that comes out in October.\n...more"
            },
            "1": {
                "date": "Apr 08, 2019",
                "content": "I received this book for free from the publisher (Quirk Books) in exchange for an honest review. OMG this book was hilarious! Mean Girls is one of my all time favorite movies so I was so excited to read this book. This book is basically the entire Mean Girls movie turned into a Shakespearean play. The author did an amazing job translating it into a Shakespeare play. All the iconic lines (You go Glen Coco!, The limit does not exist, etc.) were given a Shakespeare makeover. Even Jingle Bell Rock\nI received this book for free from the publisher (Quirk Books) in exchange for an honest review. OMG this book was hilarious! Mean Girls is one of my all time favorite movies so I was so excited to read this book. This book is basically the entire Mean Girls movie turned into a Shakespearean play. The author did an amazing job translating it into a Shakespeare play. All the iconic lines (“You go Glen Coco!”, “The limit does not exist”, etc.) were given a Shakespeare makeover. Even “Jingle Bell Rock” which is played in the iconic Christmas show scene got translated. The author also did a good job putting in stage directions. The movie does jump around a lot and the author managed to make it work by utilizing a balcony. I totally want to see this play come to life on the stage! The book also has cute little illustrations throughout which were a nice touch.If you are not familiar with Shakespearean plays, the author does include some helpful notes at the end that explain the elements. Basically, I loved how the book made Shakespeare so accessible to modern reader by combining it with a movie a lot of people know and love. It helps makes Shakespeare less intimidating. Overall, this is a must read for all Mean Girls and/or Shakespeare fans. I also recommend it for people looking for an introduction to Shakespeare but may not be ready for his actual work.\n...more"
            },
            "2": {
                "date": "Apr 06, 2019",
                "content": "Disclaimer: I received a finished copy courtesy of a Quirk Books. I am grateful for the opportunity to review a book for my readers, but this will not influence my final rating. All opinions expressed in this review are my own and based solely on the book.Omigosh, this was so much fun. I want to go binge watch this movie again and bask in its iconicness again. This totally is exactly how you thought it would go with Shakespeare and Mean Girls fun.This story is honestly if Mean Girls takes place\nDisclaimer: I received a finished copy courtesy of a Quirk Books. I am grateful for the opportunity to review a book for my readers, but this will not influence my final rating. All opinions expressed in this review are my own and based solely on the book.Omigosh, this was so much fun. I want to go binge watch this movie again and bask in its iconicness again. This totally is exactly how you thought it would go with Shakespeare and Mean Girls fun.This story is honestly if Mean Girls takes place in a Shakespearean world. It is the same story of Mean Girls with a few slight differences (I didn't pick them up), but it Shakespeare classic writing style. It's full of cute illustrations, iambic pentameter, and more. A good knowledge of Mean Girls is quite helpful, but I have to say that even though it's been some time since I've seen it, it came back instantly and the story told it well.I wasn't entirely sure how well Mean Girls would translate into Shakespeare, but honestly, it worked so well. The writing and the formats of the asides/coming in and out of the balconies were amazing. It totally worked well with the drama and the classic, iconic quotes in Shakespeare's language was so amazing. Shakespeare has never been a huge for thing for me since I haven't always been able to figure out what he was saying. However, Doescher did such a great job for making Shakespeare accessible and interesting for those that aren't the biggest Shakespeare fan. It's also such a quick read that still allows you for investment in the story and characters. While this was funny, I never fully got laugh out loud funny for me. I think I was so focused on trying to read the Shakespeare type writing. That was the only thing that kept me from being fully into it for a five crown read. But it was still wildly entertaining and totally brought the happy, fun feels. rating: 4 crowns & an Ariel ratingrepresentation: n/acontent warnings: homophobic slur (same ones that come with Mean Girls the movie)\n...more"
            },
            "3": {
                "date": "Apr 07, 2019",
                "content": "This is by far the most entertaining way to read Shakespeare."
            },
            "4": {
                "date": "Apr 11, 2019",
                "content": "On Wednesdays we wear...Ruffs?For this to be a successful read, you should really love two things: Shakespeare and Mean Girls. Yep, this is a wonderfully funny and sly homage to Mean Girls...in Shakespearean English.There are some sly Easter Eggs for fans of the movie - punny uses of Fey and fey for example and The Bard's wit seems to mesh perfectly with the film's wit.The story is funny and well told and, yes, I think Will would have gotten a kick out of the drama, betrayals and tragedy\nOn Wednesdays we wear...Ruffs?For this to be a successful read, you should really love two things: Shakespeare and Mean Girls. Yep, this is a wonderfully funny and sly homage to Mean Girls...in Shakespearean English.There are some sly Easter Eggs for fans of the movie - punny uses of Fey and fey for example and The Bard's wit seems to mesh perfectly with the film's wit.The story is funny and well told and, yes, I think Will would have gotten a kick out of the drama, betrayals and tragedy of...high school.Very nicely done!\n...more"
            },
            "5": {
                "date": "Apr 21, 2019",
                "content": "What a fun read! I adore this movie so much so reading it like a Shakespeare play was amazing.Huge thanks to the publisher for sending me a copy of the book! ❤\nWhat a fun read! I adore this movie so much so reading it like a Shakespeare play was amazing.Huge thanks to the publisher for sending me a copy of the book! ❤️\n...more"
            },
            "6": {
                "date": "May 25, 2019",
                "content": "You have to start listening to these plays. They are hilarious and fun and such a creative way of reexamining Shakespeare and pop culture classics. The full cast audio is brilliant. Everyone does a great job and you can tell the different actors really well. It makes the whole experience much more enjoyable.The one thing about this adaptation, I thought a lot of the narration and asides were confusing. I know it was in lieu of the voice over in the movie but it was difficult to translate to the\nYou have to start listening to these plays. They are hilarious and fun and such a creative way of reexamining Shakespeare and pop culture classics. The full cast audio is brilliant. Everyone does a great job and you can tell the different actors really well. It makes the whole experience much more enjoyable.The one thing about this adaptation, I thought a lot of the narration and asides were confusing. I know it was in lieu of the voice over in the movie but it was difficult to translate to the stage. Or at least, the way that was done. Also there were so many scene changes it was hard to keep up with them all. Again, that's because this was a movie but the adaptation was difficult. Finally, I just kept wanting to listen to the musical. I would often stop the audiobook and then listen to the soundtrack so that was a good thing...I guess.Overall, it's great. I'm not the biggest fan of MEAN GIRLS, but I like the musical and this was a fun new way to listen and experience the story.Conclusion: Keep\n...more"
            },
            "7": {
                "date": "Mar 21, 2019",
                "content": "Necessary? No. Funny and entertaining? Yes. On Wednesdays, we array ourselves in pink! Thanks to Netgalley and Quirk Books for the ARC\nNecessary? No. Funny and entertaining? Yes. “On Wednesdays, we array ourselves in pink!” Thanks to Netgalley and Quirk Books for the ARC\n...more"
            },
            "8": {
                "date": "May 02, 2019",
                "content": "I was shocked and amazed at how well the words of my beloved bard melded into every line of Mean Girls. I laughed, I took frequent screen shots, I sent lines to everyone I could think ofthis adaption is clever, hilarious, and so satisfying. The translated sketches are also a nice touch, making the Slam Book look like a witchs book of shadows in a high school Shakespeare textbook. I bought a copy of this already because I knew I needed to own it for posterity, so that should be a glowing review.\nI was shocked and amazed at how well the words of my beloved bard melded into every line of Mean Girls. I laughed, I took frequent screen shots, I sent lines to everyone I could think of—this adaption is clever, hilarious, and so satisfying. The translated sketches are also a nice touch, making the Slam Book look like a witch’s book of shadows in a high school Shakespeare textbook. I bought a copy of this already because I knew I needed to own it for posterity, so that should be a glowing review. I will warn those who haven’t watched the source material enough to quote it—it’s for fans, not for newcomers. This will make little to no sense to anyone who doesn’t speak fluent Mean Girls.\n...more"
            },
            "9": {
                "date": "Feb 01, 2019",
                "content": "Librarian: Question, how do you get kids interested in learning the basics of Shakespearean literature? How do you get them to understand the idea of iambic pentameter, or get them introduced to the way that Shakespearean language sounds, or how it looks on the page? Well, if you're Ian Doescher, you take classic films and rewrite them into plays that read exactly as they would if the Bard himself had written them.Many students actively resist the idea of studying Shakespeare. They think that\nLibrarian: Question, how do you get kids interested in learning the basics of Shakespearean literature? How do you get them to understand the idea of iambic pentameter, or get them introduced to the way that Shakespearean language sounds, or how it looks on the page? Well, if you're Ian Doescher, you take classic films and rewrite them into plays that read exactly as they would if the Bard himself had written them.Many students actively resist the idea of studying Shakespeare. They think that his plays are boring, and difficult to understand. They don't see the point. I believe that at least a part of this stems from the fact that they don't know HOW to read Shakespeare. Doescher's books can help to rectify that. By telling stories that students are already familiar with in Shakespeare's style, these books can provide a gateway into the way that Shakespearean literature is written. That in turn can make it easier for students to understand Shakespeare's actual plays. Highly recommend that any teen and any school librarian keep a copy of both the books in Doescher's William Shakespeare's Star Wars series, as well as this book and future books that he may write in this series on hand. I think that they may prove themselves useful as not only a form of entertainment, but also as a teaching aide.Reader: I am not a fan of Mean Girls. Never have been, probably never will be, frequent humming of \"I'd Rather Be Me\" from the Mean girls musical notwithstanding. I just have never been all that in to Teen/High School movies. I knew that going in. However, I am a HUGE fan of Ian Doescher's Willam Shakespeare's Star Wars series. as well as his delightful Shakespearean retelling of A Christmas Carol. I also knew that going in. So the question became, could Doescher transform a story I'd never really cared for into a book that I enjoyed reading? The answer is yes. Mostly. Oh, I still don't love the plot. And much like his Star Wars series, there is tendency to rely slightly too heavily on Shakespeare references and jokes. Those jokes can way the text down slightly, as they require the reader to have a decent level of familiarity with Shakespeare's plays. If the reader doesn't have that familiarity, much if the humor could be lost. Still, it's a good book, if slightly uneven feeling. I don't love it, but I did enjoy it. And I suppose that's good enough.Reading Challenge: 52 Weeks - Week #5: A Play\n...more"
            },
            "10": {
                "date": "Nov 14, 2019",
                "content": "Cleverly melding classic playwriting with a modern classic movie, Ian has created a really funny and witty reproduction. It reads exactly like the plays you remember-and probably dreaded-at school and is illustrated throughout. For those who might be put off, fear not, it may be set out like a play but as you read, you inevitably see the entire film play out in your mind's personal cinema.Basically it's like reading a screenplay!''Pink is the pigment of a welcomed soul.Pink is the cheek that\nCleverly melding classic playwriting with a modern classic movie, Ian has created a really funny and witty reproduction. It reads exactly like the plays you remember-and probably dreaded-at school and is illustrated throughout. For those who might be put off, fear not, it may be set out like a play but as you read, you inevitably see the entire film play out in your mind's personal cinema.Basically it's like reading a screenplay!''Pink is the pigment of a welcomed soul.Pink is the cheek that blusheth when in love.Pink is the underside of newborn feet.Pink is the lush camellia on the bush.''I absolutely loved the 'Shakespeare does Star Wars' series-to me they are the right length and the central joke of both series is neither belaboured nor overdone. This is purely a fan's response to cultural icons and also a reminder about the universality and longevity of Shakespeare's themes.\"Nay, Gretchen. Fetch shall never catch.Stop hosting an event no one attends.\"The bard may be enough to make people groan but taking this beloved classic and applying modern mores actually makes you understand the film better as well as teasing the reader into finding out more about Shaespeare.The plays of England's most well known and revered writer were made for as wide an audience as possible, they were made to be watched and enjoyed en masse, they were not the remit of the rich and privileged. In his books, Ian Doescher is bridging the gap by exploring the modern phenomenons of cliques, high school adolescence and peer pressure by comparing it to, amongst others, ''Much Ado About Nothing', 'The Tempest, and 'Romeo And Juliet'.Whilst laughing at Sheakespeare-d classic lines of dialogue, the reader is taking in the features of the writing (for example, iambic pentameter and the Shakespearean sonnet) so whilst it does not take long to read, this short book leaves a lasting impression.I for one loved it and am very much looking forward to 'MacTrump'!\n...more"
            },
            "11": {
                "date": "May 15, 2019",
                "content": "I think it's meant more for fans of \"Mean Girls\" who like/can tolerate iambic pentameter than it is for Shakespeare fans. I've never seen \"Mean Girls\", so got a few references, but some went over my head. Still, I think the idea is clever, and i would probably read another one of his mashups."
            },
            "12": {
                "date": "Jul 01, 2019",
                "content": "'Tis fairly fetch. Cute \"retelling\" of Mean Girls as a Shakespeare play. This is literally the movie Mean Girls, written in Shakespearean language, set as a play. I appreciated the afterword which explained some of the pentameter, some of the themes to look for and why they are reminiscent of early works. I loved finding bits of \"hidden\" references within the lines (Many from Much Ado About Nothing). I liked that each girl was reminiscent of an actual character from a play. Some lines were\n'Tis fairly fetch. Cute \"retelling\" of Mean Girls as a Shakespeare play. This is literally the movie Mean Girls, written in Shakespearean language, set as a play. I appreciated the afterword which explained some of the pentameter, some of the themes to look for and why they are reminiscent of early works. I loved finding bits of \"hidden\" references within the lines (Many from Much Ado About Nothing). I liked that each girl was reminiscent of an actual character from a play. Some lines were absolutely hilarious, and reading the characters, plots, dialogue ranged from pure gold to eye rolling. The \"problem\" was as an avid Mean Girls fan, this brought absolutely nothing new to the table. It went line for line, scene by scene copied from the movie. No adaptations, no new interpretations, it was too literal. I LOVE the movie, and maybe I'm just comparing this to the musical- which DID reinterpret something, and bring new ideas, characteristics, and some female feminism to the table. This book obviously took a lot of work and commitment to write, but I wanted something MORE. Altogether just a quick entertaining read that I will vaguely remember- absolutely nothing more than that. \n...more"
            },
            "13": {
                "date": "May 16, 2019",
                "content": "Thanks to Quirk Books for sending me a review copy of this highly entertaining book! In the same vein as the Shakespeare Star Wars series, Ian Doescher repackages the classic film Mean Girls in iambic pentameter and Shakespearean language, with very funny results. As a bit of a Shakespeare nerd who is relatively familiar with that language, I found this to be often hilarious and a very easy read. This will probably appeal to others who can navigate Shakespearean language and don't mind an\nThanks to Quirk Books for sending me a review copy of this highly entertaining book! In the same vein as the Shakespeare Star Wars series, Ian Doescher repackages the classic film Mean Girls in iambic pentameter and Shakespearean language, with very funny results. As a bit of a Shakespeare nerd who is relatively familiar with that language, I found this to be often hilarious and a very easy read. This will probably appeal to others who can navigate Shakespearean language and don't mind an irreverant take on pop culture that plays homage to the Bard. I recognized bits of dialogue from Shakespeare woven in, including some lines from Much Ado About Nothing. This was just a lot of fun!\n...more"
            },
            "14": {
                "date": "Jan 14, 2020",
                "content": "The only thing in life I love more than wine is books, but Shakespeare and Mean Girls are both quite high on my list as well. Having both combined is a fantastic treat, and I love the fact that it feels performance-ready. Though the translation isn't always flawless, the overall experience is a delightful one that I recommend to anyone whose passions include the Plastics and the Bard."
            },
            "15": {
                "date": "Mar 23, 2020",
                "content": "Imagine the entire Mean Girls movie written out like a Shakespeare play complete with the language and rhythms you would expect from William Shakespeare. Thats Much Ado About Mean Girls. Its utterly fabulous. Its so funny and reads very quickly. I highly recommend it to anyone who likes Shakespeare and enjoyed Mean Girls.\nImagine the entire Mean Girls movie written out like a Shakespeare play complete with the language and rhythms you would expect from William Shakespeare. That’s Much Ado About Mean Girls. It’s utterly fabulous. It’s so funny and reads very quickly. I highly recommend it to anyone who likes Shakespeare and enjoyed Mean Girls.\n...more"
            },
            "16": {
                "date": "Aug 03, 2019",
                "content": "3.5* I'm always impressed by the innovative ideas some people come up with. Mean Girls in iambic pentameter? Hilarious! This book combines two things I love: Shakespeare and the chick flick classic \"Mean Girls\". This book was right up my alley and I can't wait to find a place on my bookshelf for it next to the collected works of the Bard of Avon (so he'll be in good company there)."
            },
            "17": {
                "date": "Jul 02, 2019",
                "content": "such fun to read!"
            },
            "18": {
                "date": "Jun 08, 2019",
                "content": "I watched this movie just to read the book. Backwards I know, but Ive never seen this before.Anyway, the book was hilarious and spot on.\nI watched this movie just to read the book. Backwards I know, but I’ve never seen this before.Anyway, the book was hilarious and spot on.\n...more"
            },
            "19": {
                "date": "Dec 01, 2019",
                "content": "By my troth, a book I've not seen before.A twist upon my teenage film int'restsWith good humor and wit it doth adornMy senses and pleaseth me so, I sayDo pick up this good book of Sir DoescherAnd enjoy the Plastics in this new form!"
            },
            "20": {
                "date": "Feb 20, 2020",
                "content": "I absolutely love this! It is so clever, well written, and captures both elements of Shakespeare and Mean Girls!"
            },
            "21": {
                "date": "May 07, 2019",
                "content": "GRETCHEN Behold, her cheecks are redder than her tunic.Thou lovest him and he thinks well of thee.'Tis Fetch!REGINA Nay, Gretchen, \"fetch\" shall never catch,Stop hosting an event on one attends. It shall not hapthe zeitgeist thou art not.The fad is bad; I'm mad and thou art sad. [Exeunt Regina, Karen, and Aaron]GRETCHEN O, when I am again in English class,I know what is threport that I shall make:We study Caesar and his mighty acts; Ill lay him low. For who is Caesar, eh? And wherefore should\nGRETCHEN Behold, her cheecks are redder than her tunic.Thou lovest him and he thinks well of thee.'Tis Fetch!REGINA —Nay, Gretchen, \"fetch\" shall never catch,Stop hosting an event on one attends. It shall not hap—the zeitgeist thou art not.The fad is bad; I'm mad and thou art sad. [Exeunt Regina, Karen, and Aaron]GRETCHEN O, when I am again in English class,I know what is th’report that I shall make:We study Caesar and his mighty acts; I’ll lay him low. For who is Caesar, eh? And wherefore should great Caesar be allow’d To stomp and lumber like a giant bruteWhilst we do hide from his enormous feet,Attempting, fearfully, to stay unscath’d? Whence cometh all the honors he hath earn’d?Consider Brutus—is he not as fine,As smart, as likeable as Caesar, too? When did it happen that a single personBecame the boss of ev’ryone around?‘Tis not what our proud Rome doth stand for, nay!We should, therefore, stab Caesar—stab and stab—And let his blood flow down in righteous streams!CADY [aside:]‘Tis plain that Gretchen Wieners hath been crack’d.\n...more"
            },
            "22": {
                "date": "Nov 11, 2019",
                "content": "A fun adaptation of Mean Girls set in Shakespearean prose. I listed to the audiobook, and had a really enjoyable time envisioning this cult classic in the time of Shakespeare. As I was listening I kept wondering if the author had gone far enough in the adaptation. There were several instance where the contemporary jokes didn't quite land in iambic pentameter, and I thought maybe the author should have adapted further to bring the joke into the time period he was writing from. Pantaloons or\nA fun adaptation of Mean Girls set in Shakespearean prose. I listed to the audiobook, and had a really enjoyable time envisioning this cult classic in the time of Shakespeare. As I was listening I kept wondering if the author had gone far enough in the adaptation. There were several instance where the contemporary jokes didn't quite land in iambic pentameter, and I thought maybe the author should have adapted further to bring the joke into the time period he was writing from. Pantaloons or petticoats instead of \"army pants\" and slippers instead of \"flip flops\" is one that comes to mind. Overall the book was enjoyable, and it would be fun to actually watch as a play.\n...more"
            },
            "23": {
                "date": "Feb 15, 2019",
                "content": "The minute I saw this title offered on Netgalley, I put in a request, and I was delighted when it was granted. How could I wait til the release date? It is the book I never knew I always wanted. A hilarious modern movie meets my love of Shakespeare? Perfect! And frankly, it really is kind of perfect. If you've seen Mean Girls, you know the plot (the connection of Much Ado specifically is pretty tenuous). The book seems to follow the movie very closely. So the charm is in the language, and how it\nThe minute I saw this title offered on Netgalley, I put in a request, and I was delighted when it was granted. How could I wait til the release date? It is the book I never knew I always wanted. A hilarious modern movie meets my love of Shakespeare? Perfect! And frankly, it really is kind of perfect. If you've seen Mean Girls, you know the plot (the connection of Much Ado specifically is pretty tenuous). The book seems to follow the movie very closely. So the charm is in the language, and how it brings Mean Girls' plot to life in a whole new light. The author did an excellent job capturing Shakespearean-sounding language, and the characters, in all their catty, shallow glory, were well suited to Shakespearean treatment. I wasn't always sure about how he incorporated quotations from Shakespeare's plays into the work--sometimes they worked better than others. But mostly they worked well, and the author explains some of his rationale for their inclusion in an charming afterward, wherein he also waxes poetical about his gratitude to the women in his life and of his admiration of Tina Fey. Such a refreshing lack of toxic masculine posturing. This was just a wonderful, cheerful way to unwind at the end of the day. If you have come to see some of the problematic racial elements of Tina Fey's style of comedy, you will unfortunately still see them in this story. But that is a critique of the original writing, not of the loving recreation of it in this book. If you enjoy Shakespeare, even without having experienced Mean Girls, I think you could enjoy this. If you've enjoyed both Shakespeare AND Mean Girls, get thee to a bookstore as soon as this is released!(Thank you Netgalley for letting me read an advanced copy.)\n...more"
            },
            "24": {
                "date": "Nov 26, 2019",
                "content": "As a lover of Mean Girls (more so the musical than the film, though I did grow up watching the film) and an intense lover of Shakespeare, this was right up my alley. A quick and easy read but thoroughly entertaining, especially if you know the film frame by frame. It was so interesting to see how the author translated Mean Girls to classic Shakespearian text, I also enjoyed the references to some of my favorite Shakespeare plays (especially Regina saying \"If I be waspish, best beware my sting\" a\nAs a lover of Mean Girls (more so the musical than the film, though I did grow up watching the film) and an intense lover of Shakespeare, this was right up my alley. A quick and easy read but thoroughly entertaining, especially if you know the film frame by frame. It was so interesting to see how the author translated Mean Girls to classic Shakespearian text, I also enjoyed the references to some of my favorite Shakespeare plays (especially Regina saying \"If I be waspish, best beware my sting\" a personal favorite quote of mine) as well as how each of the female characters embodied one of Shakespeare's female characters.If you enjoy Mean Girls and Shakespeare take a little time to read this, you'll be entertained. \n...more"
            },
            "25": {
                "date": "Apr 18, 2019",
                "content": "This booketh wast truly a excit'ment and unique taketh on cullionly girls. I did want to giveth t a did shoot coequal though ive nev'r been able to standeth shakespearean writing, but i genuinely did enjoy reading this booketh! this booketh is fantastic to readeth if 't be true thee needeth a valorous chuckle :)-(Now for my normal review 😂)This book was truly a fun and unique take on Mean Girls. I wanted to give it a shot even though Ive never been able to stand Shakespearean writing, but I\nThis booketh wast truly a excit'ment and unique taketh on cullionly girls. I did want to giveth t a did shoot coequal though i’ve nev'r been able to standeth shakespearean writing, but i genuinely did enjoy reading this booketh! this booketh is fantastic to readeth if 't be true thee needeth a valorous chuckle :)-(Now for my normal review 😂)This book was truly a fun and unique take on Mean Girls. I wanted to give it a shot even though I’ve never been able to stand Shakespearean writing, but I genuinely enjoyed reading this book! This book is fantastic to read if you need a good laugh :) \n...more"
            },
            "26": {
                "date": "May 09, 2019",
                "content": "This book is a combination of two things that I truly love: Shakespeare and Mean Girls. I expect that many others will feel the same extreme draw towards it. It is brilliantly written, with great respect for both Shakespeare and Mean Girls. In fact, it basically transcribes the movie line for line into Shakespearean language. It is a fun read. You can almost hear the actors' voices while reading. The author did a great job of maintaining the characters' voices within the Shakespearean language.\nThis book is a combination of two things that I truly love: Shakespeare and Mean Girls. I expect that many others will feel the same extreme draw towards it. It is brilliantly written, with great respect for both Shakespeare and Mean Girls. In fact, it basically transcribes the movie line for line into Shakespearean language. It is a fun read. You can almost hear the actors' voices while reading. The author did a great job of maintaining the characters' voices within the Shakespearean language. High school drama classes and millennial book clubs need this book in their lives.\n...more"
            },
            "27": {
                "date": "Apr 01, 2020",
                "content": "Extremely creative and funny, but not one I'll be recommending. Very impressive writing skills, and I'm sure it was really difficult to write, but it was also difficult to stay focused and read for a solid hour. I have a decent understanding and respect for Shakespeare, but I think I have a little bit of a trigger problem with him after two semesters of cram-reading his plays and sonnets. This would be a great coffee table book, but I wouldn't recommend reading it like you would any other book.\nExtremely creative and funny, but not one I'll be recommending. Very impressive writing skills, and I'm sure it was really difficult to write, but it was also difficult to stay focused and read for a solid hour. I have a decent understanding and respect for Shakespeare, but I think I have a little bit of a trigger problem with him after two semesters of cram-reading his plays and sonnets. This would be a great coffee table book, but I wouldn't recommend reading it like you would any other book. I think people with a better attention span than me might be able to do that though. \n...more"
            },
            "28": {
                "date": "Apr 30, 2019",
                "content": "I tried to write this review in iambic pentameter, but turns out its a lot harder than Ian Doescher makes it look. He does such a good job of reimagining beloved quotes and classic scenes from Mean Girls into a Shakespeare play that youll start to wonder if the Bard himself has returned as a Tina Fey fan. The limit may not exist, but I am so glad that this book does.\nI tried to write this review in iambic pentameter, but turns out it’s a lot harder than Ian Doescher makes it look. He does such a good job of reimagining beloved quotes and classic scenes from Mean Girls into a Shakespeare play that you’ll start to wonder if the Bard himself has returned as a Tina Fey fan. The limit may not exist, but I am so glad that this book does. \n...more"
            },
            "29": {
                "date": "Oct 06, 2019",
                "content": "Another brilliant Shakespearean adaptation by Ian Doescher! Mean Girls really is perfect for the Shakespeare touchI especially enjoyed how the bus was used. The only thing stopping me from going a full five stars with this one is that Im so attached to the original film that it felt jarring in some places to have iconic lines not be there in the way i remember them. But the actual retelling was done in a way that was both true to Shakespeare and to Mean Girls.\nAnother brilliant Shakespearean adaptation by Ian Doescher! Mean Girls really is perfect for the Shakespeare touch—I especially enjoyed how the bus was used. The only thing stopping me from going a full five stars with this one is that I’m so attached to the original film that it felt jarring in some places to have iconic lines not be there in the way i remember them. But the actual retelling was done in a way that was both true to Shakespeare and to Mean Girls. \n...more"
            }
        }
    },
    {
        "link": "https://www.goodreads.com/book/show/43263670-do-you-mind-if-i-cancel?from_choice=true",
        "brand": "Do You Mind If I Cancel? (Things That Still Annoy Me)",
        "isbn": 9781250225825,
        "reviews": {
            "0": {
                "date": "Nov 25, 2019",
                "content": "Like if David Sedaris had zero self-awareness and was obsessed with being hot and nostalgic about his 20s"
            },
            "1": {
                "date": "Oct 08, 2019",
                "content": "I want to start this review by stating, I am obsessed with Gary Janettis Instagram. The Prince George memes are absolutely incredible and I love Family Guy, always have. But, I didnt love this book. It felt disjointed all the way through. He jumped around telling stories about growing up but I feel like I learned more about his favorite soap opera plot lines than I did about him. I did enjoy the last two pages of the book, but would have loved reading more stories about him getting into the\nI want to start this review by stating, I am obsessed with Gary Janetti’s Instagram. The Prince George memes are absolutely incredible and I love Family Guy, always have. But, I didn’t love this book. It felt disjointed all the way through. He jumped around telling stories about growing up but I feel like I learned more about his favorite soap opera plot lines than I did about him. I did enjoy the last two pages of the book, but would have loved reading more stories about him getting into the writing business and life after he moved to LA as well as his life before all that. \n...more"
            },
            "2": {
                "date": "Oct 30, 2019",
                "content": "So funny! This book is my type of humor for sure. I was highly entertained and loved every minute of it. Time flew right back while I was reading. I hope he continues writing more books like these!!"
            },
            "3": {
                "date": "Oct 20, 2019",
                "content": "I knew this would be funny, but it's also personal and honest and moving. Janetti manages to be vicious AND likable, even while chastising you for not knowing what Norma Rae is (I knew that one!). These essays are equal parts insight and acid, and you will love every second of them."
            },
            "4": {
                "date": "Feb 12, 2020",
                "content": "have been a fan of Gary Janetti for years. I follow him on twitter and I am told his Instagram is hilarious. He constantly amazes me with his outrageously odd tweets.I have also followed his career. As a producer and writer on Family Guy, the original Will & Grace, to being the executive producer and creator of Vicious, a hysterical show about an English couple, Freddie and Stuart, who have been together for over 50 years and their love/hate relationship with each other and their small group\nhave been a fan of Gary Janetti for years. I follow him on twitter and I am told his Instagram is hilarious. He constantly amazes me with his outrageously odd tweets.I have also followed his career. As a producer and writer on Family Guy, the original Will & Grace, to being the executive producer and creator of Vicious, a hysterical show about an English couple, Freddie and Stuart, who have been together for over 50 years and their love/hate relationship with each other and their small group of quirky friends, he has certainly left his mark. So with all that said, I was excited to read his book of essays, Do You Mind If I Cancel. But what I soon discovered was that Janetti had an extremely lonely childhood, who had no friends at school, who would run home after school to eat lunch (as there was no one to each lunch with at school) and watch a soap opera One Life to Live, one which he continued to watch until its end over 30 years later. He relied on his incredible imagination to keep him occupied and to drive his mother crazy!He made his first friend while attending college at Hofstra University, where he also had his first relationship. After college he became a \"writer\" in name only. He said he was one, but never seemed to get around to being one. He was just waiting for the right time. To supplement his \"writing\" career he took on odd jobs. He was a receptionist, he did bike tours for American teenagers through Europe, but he spent most of his twenties as an overnight bellhop at a hotel in New York. Essays also include his undying love for Patti Lupone, visiting the One Life to Live set as a child, traveling as a young boy and falling in love for the first time.Although the pieces are funny and unconventional, as I believe he really is, there is also a feeling of sadness, loss, a missing out during his childhood, something I think we can all identify with to a certain degree.And of course there was his moment of realization in which the soon to be thirty year old Janetti moves from being a \"writer\" to becoming an accomplished writer and producer and never looking back. Until now.\n...more"
            },
            "5": {
                "date": "Sep 18, 2019",
                "content": "I laughed and even cried in parts at Gary Janetti's new book Do You Mind If I Cancel. Some of you may know Gary because he puts up hysterical memes on Instagram of Prince George. Some of you may know Gary because he is married to the amazing stylist Brad from the Rachel Zoe show and soon after his own TV show. Last but not least you may know Gary because he is an amazing television writer. No matter how you know Gary you should definitely pick up Do You Mind If I Cancel. You will laugh and you\nI laughed and even cried in parts at Gary Janetti's new book Do You Mind If I Cancel. Some of you may know Gary because he puts up hysterical memes on Instagram of Prince George. Some of you may know Gary because he is married to the amazing stylist Brad from the Rachel Zoe show and soon after his own TV show. Last but not least you may know Gary because he is an amazing television writer. No matter how you know Gary you should definitely pick up Do You Mind If I Cancel. You will laugh and you may cry (no? just me?). I loved seeing pieces of Gary's life unfold in front of me. I felt like I was sitting down to dinner with an old friend. Such a fun read. Thank you Gary and Flatiron Books for my gifted copy of Do You Mind If I Cancel. All opinions are my own.\n...more"
            },
            "6": {
                "date": "Nov 26, 2019",
                "content": "You would think autobiographical sketches by a writer/producer of 'Will & Grace' and 'Vicious' would at the very least be uproariously funny - but these are just shallow, silly and a bit sad. I almost ditched it at the 1/3 mark, and really should have. It would have helped also if the stories had been presented in chronological order, to cut down on a lot of repetitious back-tracking - but that would have made a short book even shorter, I suppose. Disappointing, to say the least (and not to\nYou would think autobiographical sketches by a writer/producer of 'Will & Grace' and 'Vicious' would at the very least be uproariously funny - but these are just shallow, silly and a bit sad. I almost ditched it at the 1/3 mark, and really should have. It would have helped also if the stories had been presented in chronological order, to cut down on a lot of repetitious back-tracking - but that would have made a short book even shorter, I suppose. Disappointing, to say the least (and not to be TOO catty, but Janetti keeps on - and on and on - about what a looker he was when young - which is sort of belied by the author photo of what he looks like NOW! Meow!) \n...more"
            },
            "7": {
                "date": "Oct 31, 2019",
                "content": "I wish this book were 400 pages longer. I loved it beyond any review I could ever write."
            },
            "8": {
                "date": "Jan 23, 2020",
                "content": "I don't know much about Gary Janetti, but this definitely didn't make me a fan of his..."
            },
            "9": {
                "date": "Oct 25, 2019",
                "content": "I won an ARC of this book in a Goodreads giveaway.I was not familiar with Gary Janetti when I entered the giveaway, but the praise in the description saying this would be laugh-out-loud funny and similar to Tina Fey or David Sedaris drew me in. Sadly, those descriptions were just completely untrue. I thought this book started off fine, but the chapters seemed disordered. I have no idea how they chose which story to put when. There seemed to be no rhyme or reason.It also seemed to end abruptly.\nI won an ARC of this book in a Goodreads giveaway.I was not familiar with Gary Janetti when I entered the giveaway, but the praise in the description saying this would be laugh-out-loud funny and similar to Tina Fey or David Sedaris drew me in. Sadly, those descriptions were just completely untrue. I thought this book started off fine, but the chapters seemed disordered. I have no idea how they chose which story to put when. There seemed to be no rhyme or reason.It also seemed to end abruptly. It wasn't like it finally brought you to the point of Janetti finally becoming a Hollywood writer. It was just all of a sudden over. Once again,without rhyme or reason.It bothered me how often Janetti seemed to pigeonhole gay men. Like, all gay men must be exactly like him. And yet most of the time he didn't even seem to like the parts of him he was describing. It made no sense to me. Also, if he brought up how supposedly attractive he is/was one more time, I might have thrown the book away. I get it, you think you're all that and a bag of chips.The more I think about it, the more annoyed I get. It was just all so repetitive and mediocre. I don't know any more about who Gary Janetti is now than I did when I started. But now I have no desire to learn, either.\n...more"
            },
            "10": {
                "date": "Jan 26, 2020",
                "content": "Do you want to get drunk over the course of a 150-page essay collection?! If the answer is yes, do I have the drinking game for you! While reading Do You Mind If I Cancel?, simply drink every time Gary Janetti:-reminiscences about how hot he was in his 20s (bonus shot if he mentions his thick, dark hair or how impressively in shape he was!)-mentions a soap opera and/or musical you have never heard of (bonus shot if he mentions an obscure actress by name!)-declines to take an opportunity for\nDo you want to get drunk over the course of a 150-page essay collection?! If the answer is yes, do I have the drinking game for you! While reading Do You Mind If I Cancel?, simply drink every time Gary Janetti:-reminiscences about how hot he was in his 20s (bonus shot if he mentions his thick, dark hair or how impressively in shape he was!)-mentions a soap opera and/or musical you have never heard of (bonus shot if he mentions an obscure actress by name!)-declines to take an opportunity for self-reflectionYes, it's a pretty short drinking game, but no worries! You'll be wasted in no time. Tell your friends! \n...more"
            },
            "11": {
                "date": "Nov 09, 2019",
                "content": "This is a deceptively short and simple collection of essays. I needed to read it because Gary Janetti's instagram is just...amazing. It's snarky and hilarious, and I love it so much. And, he's married to Brad Goreski. So obviously I needed to see what was up. Janetti's trademark humor is certainly here. His humor is sarcastic and wry, which is often my favorite kind. The kind that's subtle enough that you could easily miss something hilarious if you're not paying attention. I couldn't help, at\nThis is a deceptively short and simple collection of essays. I needed to read it because Gary Janetti's instagram is just...amazing. It's snarky and hilarious, and I love it so much. And, he's married to Brad Goreski. So obviously I needed to see what was up. Janetti's trademark humor is certainly here. His humor is sarcastic and wry, which is often my favorite kind. The kind that's subtle enough that you could easily miss something hilarious if you're not paying attention. I couldn't help, at one point, comparing him to David Sedaris. The comparison isn't exactly right, but I do think there are hints of Sedaris here. I do think Janetti tended to focus inward a bit more, perhaps? There are certainly outside observations, but the primary focus of these essays is on Janetti himself, and some of the landmark moments of his own life. It's interesting because I went into this for the humor, and there's a ton of it, oozing from each essay. But, there are some some really raw moments and emotions behind that humor, which I think compounds the more you read. The themes begin to show, the way the stories connect. Janetti jumps around a bit in time period - shifting from him in grade school to him just after college, bach to high school, etc. But by the end, these are all pieces of a puzzle that seem to fit together just right. Earlier moments and stories become more clear or meaningful as you continue to read, and jump back to an earlier time period again. The more you get to know Janetti - especially the Janetti in these pages, the one that was searching and growing and desperately looking for his place - the more meaningful stories about going to great lengths to play sick in grade school become. Life is hard, and Janetti doesn't exactly shy away from addressing how hard it can be, especially for a gay man coming of age in the 80s, but he does mask some of that hardship behind humor, and cuts the sharpness of the pain behind these stories in the way he tells them and very carefully orders them. I really loved his final essay in particular - because it really brought everything up to that point together. Him, in this gay club, realizing that his younger years are behind him. There is so much present in that essay, including this subtle but incredibly powerful acknowledgement of the AIDS crisis in the 80s, something he was on the periphery of without probably totally realizing it at the time. There is this sense of an immense sadness as well as a crisis averted. I just really enjoyed this book. It gave me a newfound respect for Janetti, and further appreciation for his talent with storytelling, the subtlety and power of his skill. \n...more"
            },
            "12": {
                "date": "Mar 06, 2020",
                "content": "3.5 starsI feel almost guilty for rating this one so low because I did genuinely enjoy it and relate to it quite a bit. Yet its such a short book and I was really hoping for greater depth. Or maybe more humor? I love and follow the authors Instagram account where he has endless hilarious parody posts about Prince George, imagining him as a young gay boy. Gary Janetti is hilarious. At least in internet meme form. In the book? Theres some fun lines that made me crack a smile but that was basically\n3.5 starsI feel almost guilty for rating this one so low because I did genuinely enjoy it and relate to it quite a bit. Yet it’s such a short book and I was really hoping for greater depth. Or maybe more humor? I love and follow the author’s Instagram account where he has endless hilarious parody posts about Prince George, imagining him as a young gay boy. Gary Janetti is hilarious. At least in internet meme form. In the book? There’s some fun lines that made me crack a smile but that was basically it. Yet as I said, I really did enjoy the stories. I wasn’t fully sure what I was getting going into this and I’m still unsure what exactly to call it. Not quite a memoir because it’s told out of order. More vignettes, a gay male version of say Sandra Cisneros The House on Mango Street though that’s giving the book too much credit. I was a weird gay kid too, a lesbian who must have been a gay male in another life. So I was most amused, perhaps, by the similarities. It also reminded me a great deal of my gay male best friend (Hi Chris!). One of my favorites was the piece on Patti Lupone and a young Gary’s profound excitement at attending Evita on Broadway for the first time. I liked his letter to a younger version of himself and the youth hostel biking trip he lead through Europe.Yet... the essays or pieces were kind of shallow, never quite as deep as they could’ve been while never as funny as I expected and I think I would’ve been thrilled with one or the other. The very last chapter where he mentions his sister’s job in a gay bar when he was 16, how much he looked up to those men, and then finding out a few years later they had all died, early AIDS victims was perhaps the most poignant. Still we kind of gloss over the real feeling. Gary mentions how much he would go back and instead of being shy and awkward, Shake their hands and thank them. There’s also a heartbreaking line where he writes how seemingly no one cares or noticed much, that gay men were disposable. How much more could this piece have been if he’d explored both those thoughts a little more. How much better could this book have been if it had been twice as long, with real heart and soul? I imagine other LGBT and especially gay men may enjoy this one. I’m not sure many other people would get much from it. Most of the book is on Gary’s late teens to mid and late 20s and I think this worked so well for me since I’m less than two weeks away from my own 30th birthday and reflecting a lot on my life, on growing up (since my G-d, I really must be an adult now, right?), wondering where the time went and how radically different my life is, in ways good and bad, from what I ever would’ve imagined at 16. So there’s something worthwhile here. I just wanted more. \n...more"
            },
            "13": {
                "date": "Aug 12, 2019",
                "content": "Author Gary Janetti has been many things: Executive producer of hit tv shows (Will and Grace), writer for the tv show Family Guy and an actor. Add a hilarious author to his list. This book \"Do You Mind If I Cancel?: (Things That Still Annoy Me) is filled with short chapters/essays about his life that will crack up even the oldest curmudgeon (is there a female word for curmeudgeon?) Anyway, this book is a irreverent, hilarious coming of age book...also a coming out book. *I read an advance copy\nAuthor Gary Janetti has been many things: Executive producer of hit tv shows (Will and Grace), writer for the tv show Family Guy and an actor. Add a hilarious author to his list. This book \"Do You Mind If I Cancel?: (Things That Still Annoy Me) is filled with short chapters/essays about his life that will crack up even the oldest curmudgeon (is there a female word for curmeudgeon?) Anyway, this book is a irreverent, hilarious coming of age book...also a coming out book. *I read an advance copy and was not compensated for it.\n...more"
            },
            "14": {
                "date": "Dec 11, 2019",
                "content": "Look, I feel a little bad giving this two stars because it implies that it was bad. But really, it wasn't bad, it just wasn't an enjoyable read for me, a young straight Gen Z (I think?) woman. If you are the opposite of my four traits, you may enjoy this. Gary Janetti is a gay white man who grew up in Flushing in the 80s on the bread-and-butter of young gay youth in the 80s: soap operas, Patti LuPone, Sonny & Cher, etc. Most of his essays are about this, along with other things related to\nLook, I feel a little bad giving this two stars because it implies that it was bad. But really, it wasn't bad, it just wasn't an enjoyable read for me, a young straight Gen Z (I think?) woman. If you are the opposite of my four traits, you may enjoy this. Gary Janetti is a gay white man who grew up in Flushing in the 80s on the bread-and-butter of young gay youth in the 80s: soap operas, Patti LuPone, Sonny & Cher, etc. Most of his essays are about this, along with other things related to growing up New York City-adjacent in a pre-Internet era, e.g. him working at a Bennigan's, him working at a (potentially well-known, but not to me) grocery store called Waldman's, him working at a somewhat fancy hotel in Times Square called the Paramount. Also many stories of his travels and adventures in romance as a young gay man who didn't come out til later than you'd expect. So, if you like reading about New York City, commiseration on how much better and also worse life was in the 80s, and stories about being a gay man, then this book might be for you. I chuckled a few times - it was decently funny, as expected from a guy who wrote for Family Guy and Will & Grace - but not my favorite humor book of the year. \n...more"
            },
            "15": {
                "date": "Jun 28, 2019",
                "content": "Light memoir from a TV industry guy about growing up gay in Long Island and NYC in the 80s and young adulthood in the early 90s. Not bad, and could be great for anyone really into an 80s preppy gay aesthetic. Janetti pens chapter-long paens to Patti Lupone, One Life to Live, long lost jobs and old boyfriends. There's a bit too much of the 'in my day there WAS no Google, children', but otherwise an interesting glimpse into a vanished time and place."
            },
            "16": {
                "date": "Jan 06, 2020",
                "content": "Felt like I just read a really long Facebook rant"
            },
            "17": {
                "date": "Nov 03, 2019",
                "content": "Quick read but I did not find it interesting. Guess I am too old for this kind of humor."
            },
            "18": {
                "date": "Nov 01, 2019",
                "content": "If you like David Sedaris you will probably like this book. Its quick and mostly light and funny. Gary talks about growing up in the 70s and 90s and groans a lot about how much life would have been easier had google existed back then 😂My only critique would be that some of the stories would reference elements of other stories in a way as if he hadnt just talked about it. The individual chapters werent as cohesive as it couldve been. Still an enjoyable read!⭐⭐⭐💫/5, rounded up.Thanks to the\nIf you like David Sedaris you will probably like this book. It’s quick and mostly light and funny. Gary talks about growing up in the 70s and 90s and groans a lot about how much life would have been easier had google existed back then 😂My only critique would be that some of the stories would reference elements of other stories in a way as if he hadn’t just talked about it. The individual chapters weren’t as cohesive as it could’ve been. Still an enjoyable read!⭐️⭐️⭐️💫/5, rounded up.Thanks to the publisher for providing a free copy in exchange for an honest review.\n...more"
            },
            "19": {
                "date": "Oct 15, 2019",
                "content": "3.5/5I was in the mood for a lighthearted, funny read and this one hit the spot. For those of you who are unfamiliar with Gary Janetti, he has been a long-time writer for Family Guy as well as one of the executive producers of Will & Grace. The book does not cover his time on either one of these shows, but rather his arduous and unlikely path to success.Janetti provides a humorous and brutally honest insight into his journey to become a successful writer in Hollywood. You learn about his\n3.5/5I was in the mood for a lighthearted, funny read and this one hit the spot. For those of you who are unfamiliar with Gary Janetti, he has been a long-time writer for Family Guy as well as one of the executive producers of Will & Grace. The book does not cover his time on either one of these shows, but rather his arduous and unlikely path to success.Janetti provides a humorous and brutally honest insight into his journey to become a successful writer in Hollywood. You learn about his obsession with day-time soap operas, and his odd jobs at grocery stores, restaurants, and hotels in order to stay afloat. I literally found myself laughing out loud at times, especially during his stint at Bennigan's.The writing is simple and easy to follow, which made for a very quick read. I would've preferred for his stories to be in chronological order because at times I wasn't sure when something occurred. At the same time, I feel like if I were to get into the inner workings of Janetti's mind, it would flow the exact same way his stories did (in the best possible way)!Thanks to Flatiron books and Goodreads for an advanced copy of this book in exchange for a review. All opinions are my own.\n...more"
            },
            "20": {
                "date": "Feb 19, 2020",
                "content": "Maybe I should knock this down to 2.5 stars as sometimes the writing style was a little repetitive (this book is best not devoured too much at once) and this was the second library book that fell into the bath this week (I realize this is not the book's fault, but what is going on with my bath tub's edge?!).BUT, I did find this rather amusing at times and that these short essays on coming of age from your teens on up to your late twenties to be poignant and relatable. I have started to realize\nMaybe I should knock this down to 2.5 stars as sometimes the writing style was a little repetitive (this book is best not devoured too much at once) and this was the second library book that fell into the bath this week (I realize this is not the book's fault, but what is going on with my bath tub's edge?!).BUT, I did find this rather amusing at times and that these short essays on coming of age from your teens on up to your late twenties to be poignant and relatable. I have started to realize at almost 36 years old (sob) that it's really weird to look back on the 90s now. It is starting to seem so ... quaint and ridiculous all at the same time. Reading Janetti's book made me realize I'm weirdly nostalgic for rewinding tapes on VCRs and theme songs that are four minutes long at the start of a tv show and AOL instant messenger. This is how you know you're old I guess - you start to idolize stuff that actually sucked (well maybe not AIM, be still my heart). Janetti also made me see how much our culture has really changed (for the better, particularly for people in the LGBT community) and it's kind of crazy to realize that, not that long ago, how badly we were fucking that up. No nostalgia for that there. So three stars! \n...more"
            },
            "21": {
                "date": "Jan 11, 2020",
                "content": "This is a quick read, and a really funny one. Several times I was laughing out loud at Gary Janetti's memoir told through stories. There were several that resonated with me, and the one that sticks out the most is the letter he wrote to his younger self. If only we knew that half of the stuff we worried about would turn out to be no big deal, how freeing would that be? The line that gets me tearing up every time I think about it? \"Hug your dogs while you still have them.\" Gahhh. To leave it on a\nThis is a quick read, and a really funny one. Several times I was laughing out loud at Gary Janetti's memoir told through stories. There were several that resonated with me, and the one that sticks out the most is the letter he wrote to his younger self. If only we knew that half of the stuff we worried about would turn out to be no big deal, how freeing would that be? The line that gets me tearing up every time I think about it? \"Hug your dogs while you still have them.\" Gahhh. To leave it on a funny note, the One Life to Live story is epic, mostly because that was my favorite soap opera, next to General Hospital, so I knew everything he was referring to. Also to have a whole story dedicated to Patti LuPone? Amazing. Go get this book, it was just what I needed, and hopefully you will enjoy it too.\n...more"
            },
            "22": {
                "date": "Feb 12, 2020",
                "content": "My friend Laurie gave me this book and I see why she did. Gary and I agree about several things - the difficulty one faces as a 30+ year old gay man; the specialness of soap operas in the 80s and 90s; how technology has made everything easier, but also the problems it has caused; the struggle of coming out. I enjoyed his essays (some more than others), but was left feeling like the emotion and heart in some of his stories was missing. Gary is definitely funny. Gary also seems to have a very high\nMy friend Laurie gave me this book and I see why she did. Gary and I agree about several things - the difficulty one faces as a 30+ year old gay man; the specialness of soap operas in the 80s and 90s; how technology has made everything easier, but also the problems it has caused; the struggle of coming out. I enjoyed his essays (some more than others), but was left feeling like the emotion and heart in some of his stories was missing. Gary is definitely funny. Gary also seems to have a very high opinion of his looks and his talent (even from a young age), which is great for him, but he came off as very vain at times. My favorite essay was the last one where Gary talks about men he knew who died in the AIDS crisis and how the memory of their lives (which were cut short) impacts him today.\n...more"
            },
            "23": {
                "date": "Mar 23, 2020",
                "content": "Id say this is a generous 1.5 stars and Ill give the book its credits:A very easy read and I enjoy the anecdotal style. The last chapter is a very nice way to end it but apart from that nothing else really resonated with me . Perhaps that is just simply the fact that I am not a gay dude and can not relate to these experiences ??\nI’d say this is a generous 1.5 stars and I’ll give the book its credits:A very easy read and I enjoy the anecdotal style. The last chapter is a very nice way to end it but apart from that nothing else really resonated with me . Perhaps that is just simply the fact that I am not a gay dude and can not relate to these experiences ??\n...more"
            },
            "24": {
                "date": "Mar 29, 2020",
                "content": "3.5 ⭐. I liked this book, it was light and easy. It was written as short essay chapters that jumped around, which worked fine but I think I would have preferred them in a timeline order. I also would have loved a chapter focused on how he got his break and started writing for the shows, plus more about Brad! Maybe thats in his next book. :)\n3.5 ⭐️. I liked this book, it was light and easy. It was written as short essay chapters that jumped around, which worked fine but I think I would have preferred them in a timeline order. I also would have loved a chapter focused on how he got his break and started writing for the shows, plus more about Brad! Maybe that’s in his next book. :) \n...more"
            },
            "25": {
                "date": "Feb 02, 2020",
                "content": "I really wanted to like this book. The title was funny, the cover looked great, the author was a writer and producer of shows like Will & Grace and The Family Guy, and the reviews on the back cover were beyond promising (rolling-on-the-floor funny). Unfortunately, I never rolled on the floor once, or laughed out loud for that matter. The stories in the book felt all very discombobulated, and it was hard to find a rhythm. The only reason I finished the book in the first place was because it\nI really wanted to like this book. The title was funny, the cover looked great, the author was a writer and producer of shows like “Will & Grace” and “The Family Guy”, and the reviews on the back cover were beyond promising (“rolling-on-the-floor funny”). Unfortunately, I never rolled on the floor once, or laughed out loud for that matter. The stories in the book felt all very discombobulated, and it was hard to find a rhythm. The only reason I finished the book in the first place was because it was super-short (159 pages). Maybe I would have enjoyed it more if I had known who Gary Janetti was, but it just wasn’t my cup of tea. The only reason I gave it 2 stars instead of 1 was because it did have a few funny sentences sprinkled throughout (“‘Dynasty’ was a sensation that took over the fucking country for a few years in the ’80s. It was our ‘Game of Thrones’, but with shoulder pads.”). I also really enjoyed reading the last chapter (“Café Sha Sha”), but that’s about it.\n...more"
            },
            "26": {
                "date": "Jan 29, 2020",
                "content": "Considering this book is labeled \"Humor,\" I feel like it should be a lot more funny. Janetti did have some good stories, though, and I definitely learned a bit from him. At the very least, I feel less bad about being 25 without a \"real\" job. There's always time to do what you love, and we don't always have to live up to everyone else's expectations."
            },
            "27": {
                "date": "Feb 23, 2020",
                "content": "I laughed so hard I peed my pants. Thats really all you need to know. This collection of essays from Janettis time in NY was hilarious and heartfelt, and proves why hes an amazing tv writer and producer. And I freaking LAUGHED. Short, sweet, hilarious.\nI laughed so hard I peed my pants. That’s really all you need to know. This collection of essays from Janetti’s time in NY was hilarious and heartfelt, and proves why he’s an amazing tv writer and producer. And I freaking LAUGHED. Short, sweet, hilarious. \n...more"
            },
            "28": {
                "date": "Nov 16, 2019",
                "content": "I love Gary Janetti's Instagram page and looked forward to more of his humor in this memoir/collection of essays. The humor carries through and I really enjoyed it. I started out listening to the audio book and do not recommend that. Gary is the narrator and I just couldn't stand his monotone cadence. Halfway through, I switched to the Kindle version and realized I much preferred reading his words myself."
            },
            "29": {
                "date": "Nov 20, 2019",
                "content": "One of my favorites! I haven't laughed or enjoyed personal essays since reading Jen Lancaster's first book! I can't wait to go back and read this a second time (only because I read most it of after putting my newborn to sleep ... and I would often fall asleep myself). If you appreciate honest writing that will make you \"literally\" laugh out loud, read this (oh! and follow Gary on Instagram too!!!)."
            }
        }
    },
    {
        "link": "https://www.goodreads.com/book/show/40983137-southern-lady-code?from_choice=true",
        "brand": "Southern Lady Code",
        "isbn": 9780385543897,
        "reviews": {
            "0": {
                "date": "Apr 16, 2019",
                "content": "Southern Lady Code: \"If you don't have something nice to say, say something not-so-nice in a nice way.\"After a couple of books that were misses, Marialyce and I decided to go a different route and read a book of humorous essays, Southern Lady Code. We were ready for some laughs.At 224 pages this is a quick, easy read, perfect as a palate cleanser. Helen Ellis is witty and snarky and delivers more than a few lines that made me chuckle out loud. Other essays were misses, but overall I would\nSouthern Lady Code: \"If you don't have something nice to say, say something not-so-nice in a nice way.\"After a couple of books that were misses, Marialyce and I decided to go a different route and read a book of humorous essays, Southern Lady Code. We were ready for some laughs.At 224 pages this is a quick, easy read, perfect as a palate cleanser. Helen Ellis is witty and snarky and delivers more than a few lines that made me chuckle out loud. Other essays were misses, but overall I would recommend it as a good book to toss in the beach bag. 3 starsFor our review, and others, please check out Marialyce's blog https://yayareadslotsofbooks.wordpres...*many thanks to Edelweiss, Doubleday, and the author for a free copy of the book in exchange for an honest review\n...more"
            },
            "1": {
                "date": "Apr 16, 2019",
                "content": "This was a fun easy read, just a couple of hours of stories that were suppose to inform Southern ladies about the way they act, which of course is always the correct way. Being a transported Southern lady, I was anxious to see what I needed to do to be part and parcel of the Southern Lady culture. Along the way, I picked up a few pointers, chuckled a few times, and pretty much liked the essays presented.You can't be a Southern lady though without the term \"Bless your heart\" a phrase that has\nThis was a fun easy read, just a couple of hours of stories that were suppose to inform Southern ladies about the way they act, which of course is always the correct way. Being a transported Southern lady, I was anxious to see what I needed to do to be part and parcel of the Southern Lady culture. Along the way, I picked up a few pointers, chuckled a few times, and pretty much liked the essays presented.You can't be a Southern lady though without the term \"Bless your heart\" a phrase that has more meaning and innuendo then I ever imagined. Sadly though it was missing in these essays, but that being said the bits and pieces we learn about Southern ladies was cute and full of whimsy. While some of the essays made me chuckle, there were some that seemed to fall a bit on the not so funny side for this Southern lady. However, on the whole this collection is a good way to while away one's time on the beach or traveling.Jan and I read this one and are interested in looking into this author's other stories. Recommended to those who long for a book that has short bits and pieces of a culture many of us embrace as our own.Thank you to Helen Ellis, Doubleday Books and Edelweiss for a copy of this book which is publishing today!You can find our reviews of this book here: http://yayareadslotsofbooks.wordpress...\n...more"
            },
            "2": {
                "date": "Nov 26, 2018",
                "content": "Southern Lady Code: Essays This is an entertaining collection of funny essays by Helen Ellis written with wit and candor and touching on family and marriage. Having lived in the South for a couple of decades now, I found plenty to grin at and relate to. If youre Southern or know someone who is, youll likely enjoy it too, or if you like sassy, slightly snarky humor. I enjoyed the style of humor. My thanks for the advance electronic copy that was provided by NetGalley, author Helen Ellis, and the\nSouthern Lady Code: Essays This is an entertaining collection of funny essays by Helen Ellis written with wit and candor and touching on family and marriage. Having lived in the South for a couple of decades now, I found plenty to grin at and relate to. If you’re Southern or know someone who is, you’ll likely enjoy it too, or if you like sassy, slightly snarky humor. I enjoyed the style of humor. My thanks for the advance electronic copy that was provided by NetGalley, author Helen Ellis, and the publisher for my fair review.Also on my BookZone blog:https://wordpress.com/post/bookblog20...\n...more"
            },
            "3": {
                "date": "Nov 12, 2018",
                "content": "Helen Ellis is hilarious, brilliant, and utterly mad. Southern Lady Code will make you a better woman or a better man  once you have cleaned up the coffee you spit through your nose from laughing so hard. I loved this book: every essay and every word.\nHelen Ellis is hilarious, brilliant, and utterly mad. Southern Lady Code will make you a better woman or a better man — once you have cleaned up the coffee you spit through your nose from laughing so hard. I loved this book: every essay and every word.\n...more"
            },
            "4": {
                "date": "Mar 10, 2019",
                "content": "Received via Netgalley in exchange for a fair and unbiased review.I love good southern humor. We bless hearts and sip sweet tea and smile sweetly as we mention that your outfit is so daring, we could never pull that off. This is not good southern humor. This doesn't even come close to good southern humor. I believe Helen Ellis is probably a fantastic oral story teller. When you tell a funny story in person, you get to embellish, make hand gestures, enunciate different words. The presentation of\nReceived via Netgalley in exchange for a fair and unbiased review.I love good southern humor. We bless hearts and sip sweet tea and smile sweetly as we mention that your outfit is so daring, we could never pull that off. This is not good southern humor. This doesn't even come close to good southern humor. I believe Helen Ellis is probably a fantastic oral story teller. When you tell a funny story in person, you get to embellish, make hand gestures, enunciate different words. The presentation of a funny story is far more important than the story itself. In person, maybe the story of Helen accidentally mistaking someone else's $800 coat for her own $800 coat is hysterical. But there's no umph to this story. She calls two people, confirms it's not their coat, then she and her husband go to a store to buy a $1200 coat to make her feel better about her belief that the coat she has is not her own. This story is a lot of things, but funny isn't one of them. Same for the story of a friend's husband's tale of a three-way he witnessed. That sounds like an amazing set up, but too much time is spent dissecting the husband's story telling method, and the wife's response to hearing the same story repeatedly. That is not humor. It's barely story telling in itself. The only story I enjoyed was Serious Women, wherein Helen sits in the courtroom while her friend prosecutes a woman who murdered a former high school classmate and cut her baby out, pretending it was hers. There was no humor in this story. There wasn't supposed to be. And the story telling itself wasn't particularly good. But I kept thinking, \"Damn, did someone write a book about this? Because I would read it.\" Then I set this book down and started googling the news story. This is not a good book. There's no Southern Lady Code word for that. It's just bad. \n...more"
            },
            "5": {
                "date": "Jul 01, 2019",
                "content": "\"From here on out I'll consider myself an antique lamp. I am worth something and polished. I may be fragile, but I've survived. I am a conversation starter. I'll never be too old to light up a room.\" -- Helen EllisI have to begin by (again) complimenting my local library system - without them obtaining and then displaying Ellis' Southern Lady Code on their new release shelf I probably wouldn't have even heard of it or read it. I do like a good collection of diverse humorous essays, and this is\n\"From here on out I'll consider myself an antique lamp. I am worth something and polished. I may be fragile, but I've survived. I am a conversation starter. I'll never be too old to light up a room.\" -- Helen EllisI have to begin by (again) complimenting my local library system - without them obtaining and then displaying Ellis' Southern Lady Code on their new release shelf I probably wouldn't have even heard of it or read it. I do like a good collection of diverse humorous essays, and this is one of those books.Ellis, an Alabama native now residing in New York City, references the 'Southern Lady Code' in most of her twenty-plus succinct compositions. Said 'Code,' which she learned from her mother who is also named Helen (and who I imagine to sound like the late great actress Dixie Carter, best known from TV's Designing Women and Family Law), is being sort of diplomatic or at least less verbally blunt using a certain phrase or phrasing. (For example: 'put together,' in regards to clothing - \"You can take me to church or a [chain restaurant] and I'll fit in just fine.\" More honey, less vinegar - got it?) Ellis riffs on all sorts of subjects - marriage, health issues, etiquette, and a particularly memorable 13th birthday party. Possibly my favorite - and there were only one or two duds in the line-up - was the penultimate and uncommonly serious 'Serious Women,' in which she shadowed a friend she greatly respects, an assistant district attorney who is prosecuting a shocking kidnapping / murder case.\n...more"
            },
            "6": {
                "date": "Feb 05, 2019",
                "content": "A decidedly average essay collection. I loved some of these essays and loathed others. Helen Ellis has a strong voice that shines through all of her writing, but sometimes she misses the mark with humor. She leads such a clearly privileged life that it's often hard to relate to some of the things she deals with (ex. having to buy a new $1,500 Burberry coat after she misplaces her old one). Also, as a born and bred Southern Lady™ myself, I really wanted this to be more... Southern. With themed\nA decidedly average essay collection. I loved some of these essays and loathed others. Helen Ellis has a strong voice that shines through all of her writing, but sometimes she misses the mark with humor. She leads such a clearly privileged life that it's often hard to relate to some of the things she deals with (ex. having to buy a new $1,500 Burberry coat after she misplaces her old one). Also, as a born and bred Southern Lady™️ myself, I really wanted this to be more... Southern. With themed essay collections, I like the thread of the theme to be present throughout each essay, and I felt like this theme often got lost.\n...more"
            },
            "7": {
                "date": "Apr 17, 2019",
                "content": "Southern Lady Code: a technique by which, if you don't have something nice to say, you say something not so nice in a nice way.Just a couple days before the release of Southern Lady Code, Helen Ellis tweeted:I am the kind of woman who likes to make you clutch your pearls. Helen Ellis (@WhatIDoAllDay) April 14, 2019And bless her heart, she succeeds with this new collection of essays!  From witnessing a man fake a shooting at a Halloween birthday party full of eighth-graders in Party Foul to being\nSouthern Lady Code: a technique by which, if you don't have something nice to say, you say something not so nice in a nice way.Just a couple days before the release of Southern Lady Code, Helen Ellis tweeted:I am the kind of woman who likes to make you clutch your pearls.— Helen Ellis (@WhatIDoAllDay) April 14, 2019And bless her heart, she succeeds with this new collection of essays!  From witnessing a man fake a shooting at a Halloween birthday party full of eighth-graders in Party Foul to being the only woman invited to a bachelor party in A Room of One's Own (That's Full of Gay Men), Ellis offers up some entertaining and often embarrassing stories!  She covers everything from being the slob in her marriage, the decision to remain child-free, and the certainty she's stolen another woman's Burberry trench coat.Sprinkled throughout are some Southern Lady Code gems:My husband fell in love with a creative woman. '\"Creative\" is Southern Lady Code for slob.\"Trying\" is Southern Lady Code for telling everyone and your mother that you're having intercourse to conceive.\"It's an heirloom\" is Southern Lady Code for cold steel and ammunition.\"Put together\" is Southern Lady Code for you can take me to church or Red Lobster and I'll fit in fine.Throw in some stories about pornography, marijuana, and ghosts (and also some brief mentions of Designing Women) and you have an amusing collection of essays that will allow people who are not Southern by the grace of God to interpret the code of Southern ladies.If you love to laugh, this is a great collection you can breeze through in an hour or so.  If you enjoy the book, I recommend the author's podcast also titled Southern Lady Code; all episodes of season one are available to download!Southern Lady Code was released by Doubleday on April 16, 2019.For more reviews, visit www.rootsandreads.wordpress.com\n...more"
            },
            "8": {
                "date": "Oct 21, 2018",
                "content": "I read about half of this book and didnt find it interesting or particularly funny so I stopped reading and moved on. Ive lived my entire life in the south so, sure, I saw some truths in her essays, but nothing any random person I met here on the street couldnt articulate just as clearly as she does. I think there are readers who will love this book, but I was hoping for something on par with Jenny Lawson and this just wasnt up to my southern standard for funny women.\nI read about half of this book and didn’t find it interesting or particularly funny so I stopped reading and moved on. I’ve lived my entire life in the south so, sure, I saw some truths in her essays, but nothing any random person I met here on the street couldn’t articulate just as clearly as she does. I think there are readers who will love this book, but I was hoping for something on par with Jenny Lawson and this just wasn’t up to my southern standard for funny women.\n...more"
            },
            "9": {
                "date": "Apr 28, 2019",
                "content": "A light read with some giggles for anyone who knows southern women. I like the idea of an Alabama southerner serving onion dip and cheese log to their friends in Manhattan but had a hard time identifying with coats around $1k.. must be a different south from mine!I had a copy of this from the publisher from NetGalley. The book came out April 16, 2019."
            },
            "10": {
                "date": "Dec 10, 2018",
                "content": "This book is overflowing with personality and humor - I can't tell you how many times I laughed aloud. There is nothing Helen Ellis writes that I won't buy immediately. She's that good."
            },
            "11": {
                "date": "Jun 13, 2019",
                "content": "I DNF'd this book around halfway through. I wanted to like it so much - I'm from the south and I love witty, honest portrayals of what life is like. But this book was just everything I hated about where I grew up, and none of the good parts. Ellis is sexist, fetishizes her gay friends, and thinks she's way funnier than she really is."
            },
            "12": {
                "date": "Feb 06, 2019",
                "content": "Hilarious candid essays by this former \"southern lady\" now living on the Upper East Side of NYC. If you can wait, get this in audio as I believe it would be entertaining to have the author read these essays. In the meantime, subscribe to her podcast.Thanks to the publisher for the advance reading copy."
            },
            "13": {
                "date": "Apr 16, 2019",
                "content": "Southern Lady Code gives us a peek into what it is to be a lady.Imagine me crossing my legs daintily and lifting my teacup while saying lady.While it doesnt have the same venom and bite of American Housewife, Southern Lady Code gives us more down-to-earth tips and tricks on surviving as a lady in a mans world.Some of the tips and observations here are hilarious. For example:And then came Marie Kondos book The Life-Changing Magic of Tidying Up. Or as I like to call it: Surprise, Youre Still a\nSouthern Lady Code gives us a peek into what it is to be a lady.Imagine me crossing my legs daintily and lifting my teacup while saying “lady.”While it doesn’t have the same venom and bite of American Housewife, Southern Lady Code gives us more down-to-earth tips and tricks on surviving as a lady in a man’s world.Some of the tips and observations here are hilarious. For example:“And then came Marie Kondo’s book The Life-Changing Magic of Tidying Up. Or as I like to call it: “Surprise, You’re Still a Hoarder!”Helen Ellis, Southern Lady CodeYep. I’ve had that feeling.The real-life wife portrayed here is a bit softer than the fictional one in American Housewife. A bit more compromising, sometimes old-fashionedly so. She urges us to incorporate the football foam finger into lovemaking on Superbowl Sunday and tells us what it is to be properly put together.I may be a bit biased in Ellis’ favor, though. I am a grandchild of a proper southern lady. My Grandmere, Rubye, was a force. She sold mass amounts of Tupperware and attended Eastern Star meetings in formal dresses she sewed herself. Southern ladies live on. And they are fabulous.Many thanks for Netgalley and Doubleday Books for providing an advance e-reader copy in exchange for an honest review.\n...more"
            },
            "14": {
                "date": "Sep 29, 2018",
                "content": "SOUTHERN LADY CODE is Southern Lady Code for the perfect essay collection. Its sharper than a shattered Christmas ornament, but an ornament with a sense of humor. You might cut yourself, but youll laugh about it. Would I give just about anything to spend a Friday night at her apartment, drinking and putting together a spooky owl puzzle? Why, yes. Yes, I would.\nSOUTHERN LADY CODE is Southern Lady Code for the perfect essay collection. It’s sharper than a shattered Christmas ornament, but an ornament with a sense of humor. You might cut yourself, but you’ll laugh about it. Would I give just about anything to spend a Friday night at her apartment, drinking and putting together a spooky owl puzzle? Why, yes. Yes, I would.\n...more"
            },
            "15": {
                "date": "Jun 14, 2019",
                "content": "A mixed bag of essays about life as a \"Southern lady.\" The \"code,\" of course, is the mindset, euphemisms, and habits that allow a southern lady to sail gracefully through any situation, blithely accepting family ghosts, rendering men compliant with a withering glance or charming phrase, and confidently justifying her choices with an airy \"Well, of course I did.\" A few of the essays were really fun -- my favorite was \"The Ghost Experience\" -- but most were just okay. Ellis seems to feel\nA mixed bag of essays about life as a \"Southern lady.\" The \"code,\" of course, is the mindset, euphemisms, and habits that allow a southern lady to sail gracefully through any situation, blithely accepting family ghosts, rendering men compliant with a withering glance or charming phrase, and confidently justifying her choices with an airy \"Well, of course I did.\" A few of the essays were really fun -- my favorite was \"The Ghost Experience\" -- but most were just okay. Ellis seems to feel surprisingly defensive about her decision not to have children, and that got tiresome. I listened to this, read by the author, and she is a good reader (though I wish she would cut back on her use of her \"cutesy\" voice). However, the audio led to a mortifying situation for me, and I'm (completely unfairly) rounding my rating down rather than up for that. What happened was this... I had about an hour left of book and decided to listen to it at the hair salon, where I was getting my color rejuvenated. I had my wireless earbuds in and everything was going fine until my stylist bumped an earbud while wrapping foil around a strand of hair. I was on the chapter called \"An Emily Post for the Apocalypse,\" in which Ellis talks about her mother's advice on what a lady should do in various outrageous situations. At the moment my earbud was bumped, which caused the audio to stop transmitting through the buds and start blaring through my phone's speaker, she was describing what one does when one comes home and finds a repairman mast*****ing in one's living room. There was dead silence in the salon. \"Awkward\" falls utterly short. And if Ellis's mother had a trick for smoothing over the unexpected broadcast of what sure sounded like a filthy book in a peaceful salon, Ellis didn't include it here.Anyway, this is quick and moderately amusing.\n...more"
            },
            "16": {
                "date": "Jun 03, 2019",
                "content": "A fast read. These essays werent that interesting to me. I couldnt connect to the topics.\nA fast read. These essays weren’t that interesting to me. I couldn’t connect to the topics. \n...more"
            },
            "17": {
                "date": "Sep 12, 2019",
                "content": "Such an enjoyable read! I loved her collection of stories (American Housewife), and this book of essays is brilliant as well. She is so funny. I had to put this book away and pick up something else to read during my daughter's cello lesson, because I couldn't hold in my laughter and was about to cause an unwelcome distraction. I recommend Helen Ellis to pretty much everyone!"
            },
            "18": {
                "date": "Oct 29, 2019",
                "content": "Was an okay read. Not near as funny as I thought it would be from the description."
            },
            "19": {
                "date": "Aug 27, 2018",
                "content": "Oh my goodness. First, thank you to Doubleday Books and NetGalley for an e-ARC of Southern Lady Code. I started this book in the late evening, in bed, and that might've been a mistake. I was laughing out loud just as my husband was drifting off to sleep. The big surprises 1. I'd never read Helen Ellis' books prior to this; 2. there is also heart and poignancy in her writing mixed in with the humor. It's genuine, a fun read and a little laughter is something we can all use. Best of all: I use\nOh my goodness. First, thank you to Doubleday Books and NetGalley for an e-ARC of Southern Lady Code. I started this book in the late evening, in bed, and that might've been a mistake. I was laughing out loud just as my husband was drifting off to sleep. The big surprises 1. I'd never read Helen Ellis' books prior to this; 2. there is also heart and poignancy in her writing mixed in with the humor. It's genuine, a fun read and a little laughter is something we can all use. Best of all: I use more southern phrases than is probably wise, and I've added a few to my mix. LOVE this book.\n...more"
            },
            "20": {
                "date": "May 07, 2019",
                "content": "While I enjoyed reading her book of short stories, \"American Housewife,\" this book just did not hold up. Too much of it simply came across as judgmental (i.e., in a section titled 'Young Ladies, Listen to Me', she writes, \"Leggings are not pants. Dying your hair gray is not a good idea. And neither are those inner-arm, rib-cage, and finger tattoos\" (171)). It's too bad, but I will not be reading any other works she may possibly write in the future."
            },
            "21": {
                "date": "Jun 10, 2019",
                "content": "I'm glad I read American Housewife first and loved it, because if I had read this one first, I never would have read another book by her. She seems spiteful and definitely not like someone I want to know, much less keep reading about."
            },
            "22": {
                "date": "Sep 20, 2018",
                "content": "Funny, smart and Southern. This was my first time reading Helen Ellis and it will NOT be my last!"
            },
            "23": {
                "date": "Apr 26, 2019",
                "content": "Thanks to Harper Books and Edelweiss for an advanced copy of this book.Elliss short story collection, American Housewife (my review), was hit and miss for me, but the hits led me to believe Id love her brand of nonfiction social commentary. And, I was mostly right! Ellis has an inappropriate, outrageous sense of humor (my favorite!). And, pairing it with her spot-on social commentary on the South can be magic. Ellis now lives in New York, which I think gives her some necessary perspective on the\nThanks to Harper Books and Edelweiss for an advanced copy of this book.Ellis’s short story collection, American Housewife (my review), was hit and miss for me, but the hits led me to believe I’d love her brand of nonfiction social commentary. And, I was mostly right! Ellis has an inappropriate, outrageous sense of humor (my favorite!). And, pairing it with her spot-on social commentary on the South can be magic. Ellis now lives in New York, which I think gives her some necessary perspective on the South that makes her commentary even better. She covers marriage, thank-you notes, general etiquette (courtesy of her mother), and crazy stories from her childhood a la Jenny Lawson (I loved these).Some of these essays are outrageously funny, while some are still fairly outrageous (but less so for Ellis), but also poignant. And, the ones with some poignancy were my favorites. She writes poignantly about her decision to be child-free in “Free to Be…You and Me (and Childfree)” and her friend Meredith’s work as an Assistant District Attorney in the Bronx in “Serious Women.” And, her social commentary shines in “Party Foul” (a crazy story from her childhood) and “Emily Post for the Apocalypse” (her mother’s view on manners for “extreme situations”). The only mis-step for me was the mini-essays that are collections of one-sentence thoughts on a topic…these just didn’t work for me and broke up the rhythm of collection. Southern Lady Code was exactly the balm I was looking for following the immersive experience of Miracle Creek!Visit https://www.sarahsbookshelves.com for more reviews.\n...more"
            },
            "24": {
                "date": "Jul 19, 2019",
                "content": "Cute, fun, short. And funny."
            },
            "25": {
                "date": "Jan 25, 2020",
                "content": "I read this book in less than two hours. It was funny, I guess, but it was less about cute things Southern ladies say (i.e., \"bless their heart\" is throwing shade), and more about rich people people problems (i.e., accidentally picking up someone else's $800 coat and feeling so \"weird\" about the coat's wrongness that you end up buying a new $1800 coat). Im not mad that I read it, but I probably wont remember it in two weeks.\nI read this book in less than two hours. It was funny, I guess, but it was less about cute things Southern ladies say (i.e., \"bless their heart\" is throwing shade), and more about rich people people problems (i.e., accidentally picking up someone else's $800 coat and feeling so \"weird\" about the coat's wrongness that you end up buying a new $1800 coat). I’m not mad that I read it, but I probably won’t remember it in two weeks.\n...more"
            },
            "26": {
                "date": "Apr 29, 2019",
                "content": "Sassy, salty and fresh this was a fun book of essays.Im coming up on nearly a decade of living in Texas so I think I can officially call myself a southern lady. Honestly before moving here I thought it was all cowboys and nothing in the world prepared me for the damn heat. Awe she smells sweet is southern lady code for you have massive body odor from the 1000-degree temperature outside so go jump in the shower please.Some of my favorite essays were; How to Stay Happily Married, Straighten Up and\nSassy, salty and fresh this was a fun book of essays.I’m coming up on nearly a decade of living in Texas so I think I can officially call myself a southern lady. Honestly before moving here I thought it was all cowboys and nothing in the world prepared me for the damn heat. Awe she smells sweet is southern lady code for you have massive body odor from the 1000-degree temperature outside so go jump in the shower please.Some of my favorite essays were; How to Stay Happily Married, Straighten Up and Fly Right, Tonight We’re Gonna Party Like it’s 1979 and That Kind of Woman. There were a few essays I didn’t particularly connect with but overall this was an enjoyable read and has something for everyone.So, mind your manners and pick up a copy (available now). Don’t forget to send me a thank-you note after you are done reading.Bless your heart xoxo3 stars \n...more"
            },
            "27": {
                "date": "Mar 04, 2019",
                "content": "A book of humorous essays from a Southern lady living in New York City.I thought this was a super quick and easy read. I read through the whole thing in just 3-4 treadmill work outs where I like to read on my Kindle. Helen Ellis is funny with a touch of that Southern charm that I've always loved! While none of the stories were laugh out loud funny to me, they were silly and enjoyable. I didn't necessarily relate much to her (wealthy, Southern bred lady), but I enjoyed her take on life and her\nA book of humorous essays from a Southern lady living in New York City.I thought this was a super quick and easy read. I read through the whole thing in just 3-4 treadmill work outs where I like to read on my Kindle. Helen Ellis is funny with a touch of that Southern charm that I've always loved! While none of the stories were laugh out loud funny to me, they were silly and enjoyable. I didn't necessarily relate much to her (wealthy, Southern bred lady), but I enjoyed her take on life and her \"Southern Lady Code,\" which is basically saying something not so nice but in a nice way.I'd definitely read more from her. In fact, I'd kind of like to be her friend. If you're in the mood for something light, check this one out.\n...more"
            },
            "28": {
                "date": "Dec 08, 2018",
                "content": "Helen Ellis makes me laugh out loud. If you can use some of that, you may want to read this book. Thanks go to Doubleday and Net Galley for the review copy. Southern Lady Code is a title that carries a code of its own. Some people use the word lady to describe European royalty; some to describe a courteous woman, which is what I anticipated here; and some use it to describe a well-mannered woman with a very comfortable income, which appears to be the authors operating definition. In terms of the\nHelen Ellis makes me laugh out loud. If you can use some of that, you may want to read this book. Thanks go to Doubleday and Net Galley for the review copy. Southern Lady Code is a title that carries a code of its own. Some people use the word “lady” to describe European royalty; some to describe a courteous woman, which is what I anticipated here; and some use it to describe a well-mannered woman with a very comfortable income, which appears to be the author’s operating definition. In terms of the “code,” I thought I’d be reading straight satire, but discovered that she has provided a combination of self-help tips and searing, sometimes raucous humor. It works surprisingly well. I have never made a cheese log before or wanted one, but Ellis’s recipe sounds so persuasively delicious that I may try it. That said, my favorite essays were short on advice and long on humor. I nearly hurt myself laughing over the construction man she found masturbating in her bedroom—did I mention that she gets a little edgy here? And “The Ghost Experience” is massively entertaining. There’s a lot of good material. Though at times her outlook is a little more conservative than my own, I like the things she says in support of gay and trans friends. Ultimately, I suspect that I am not the target audience for Ellis, who in her middle-aged years is dispensing life skills wrapped in bountiful amounts of humorous anecdotes. She is writing to her peers and to those women younger than herself. I am ten or twenty years older than this woman, but I still came away impressed. So, ladies and women, if you can look past the assumption of a greater-than-average income, you’ll have a good time here, and if you can’t, try to get this collection at the library and read selectively, because more of these essays will resonate than not, for all of us. I rate this book four giggles, and it will be available to the public tomorrow, April 16, 2019.\n...more"
            },
            "29": {
                "date": "Sep 16, 2018",
                "content": "I thoroughly enjoyed reading this hilarious book of essays, so much so I read parts out loud to my husband of 27 years. Growing up in the south in the same time frame I could so relate to your southern childhood and motherly advice. It is truly a wonderful way to be raised, the basis of kindness and being polite is something that really makes the world a better, happier place. This is the first thing I have read by Mrs. Harris, but it will not be the last! From one dense breast to another MAMA\nI thoroughly enjoyed reading this hilarious book of essays, so much so I read parts out loud to my husband of 27 years. Growing up in the south in the same time frame I could so relate to your southern childhood and motherly advice. It is truly a wonderful way to be raised, the basis of kindness and being polite is something that really makes the world a better, happier place. This is the first thing I have read by Mrs. Harris, but it will not be the last! From one dense breast to another MAMA LIKE!Thank you NetGalley for the ARC and the opportunity to find a new favorite author for a review. \n...more"
            }
        }
    },
    {
        "link": "https://www.goodreads.com/book/show/41188319-the-field-guide-to-dumb-birds-of-north-america?from_choice=true",
        "brand": "The Field Guide to Dumb Birds of North America",
        "isbn": 9781452174037,
        "reviews": {
            "0": {
                "date": "Mar 28, 2019",
                "content": "The Field Guide to Dumb Birds of North America by Matt Kracht is a book I requested from NetGalley and the review is voluntary. This book is going in my favorite folder for sure! This is hilarious! I laughed out loud and giggled all the way through! The author has a wicked sense of humor, clever, witty, and the funniest art! His bird \"guide\" has everything from rules to follow, tools, how to keep a journal, and his own description and art of birds. He has his name for the birds and then the\nThe Field Guide to Dumb Birds of North America by Matt Kracht is a book I requested from NetGalley and the review is voluntary. This book is going in my favorite folder for sure! This is hilarious! I laughed out loud and giggled all the way through! The author has a wicked sense of humor, clever, witty, and the funniest art! His bird \"guide\" has everything from rules to follow, tools, how to keep a journal, and his own description and art of birds. He has his name for the birds and then the common name. A description of the birds then their color or tips about them or both. Then the picture. My gosh, my stomach hurt from laughing! I read bits to my mom who is in her 80's and she started laughing! This is a book for any bird lover, animal lover, or anyone that needs a good laugh!\n...more"
            },
            "1": {
                "date": "Jan 09, 2020",
                "content": "I saw this book as sixth place in the 2019 Goodreads Choice Award humor category so thought I would order it from the library. I thought the title was pretty funny, and I thought the juvenile humor might just appeal to some of the actual juveniles in this house, but I didn't share it with them because the main comedic strategy is to use Marine-level swearing (cf, that picture book for adults, Go the F... to Sleep) such as replacing Red-Breasted Sapsucker with Red-breasted Shitsucker, and so on.\nI saw this book as sixth place in the 2019 Goodreads Choice Award humor category so thought I would order it from the library. I thought the title was pretty funny, and I thought the juvenile humor might just appeal to some of the actual juveniles in this house, but I didn't share it with them because the main comedic strategy is to use Marine-level swearing (cf, that picture book for adults, Go the F... to Sleep) such as replacing Red-Breasted Sapsucker with Red-breasted Shitsucker, and so on. The juvenile humor is mildly funny, I guess: Belted King-Pisser instead of Kingfisher, or Dumb Western Bluebird instead of Western Bluebird, so the point of the joke is to make the author actually appear dumb. Self-parody.\"He draws pretty well for being so dumb! Matt Kracht? Nope, Matt Crocked, haw haw haw haw haw! Put that in your nest and suck an egg, Matt Crap!\"--From the boid Crap calls Red-winged Butt-Wad! \"Pretty funny, Not! That's Red-Winged Blackbird to you, wise guy! Don't give up your day job!\"\n...more"
            },
            "2": {
                "date": "Apr 10, 2019",
                "content": "It's SPRING and if you live above the equator that means that the weather should be getting warmer and the dumb birds are hopping around and making their usual incessant noise and pooping on your cars and waking you at ungodly hours. I say \"should' because it is supposed to snow across most of North America this week and dumb because, hello? Who wakes up before the sun rises on purpose!?! :) Yes, I love birds. I adore them. I feed them and attract them and I really do have a backyard wildlife\nIt's SPRING and if you live above the equator that means that the weather should be getting warmer and the dumb birds are hopping around and making their usual incessant noise and pooping on your cars and waking you at ungodly hours. I say \"should' because it is supposed to snow across most of North America this week and dumb because, hello? Who wakes up before the sun rises on purpose!?! :) Yes, I love birds. I adore them. I feed them and attract them and I really do have a backyard wildlife habitat. Like the book, The Field Guide to Dumb Birds of North America, I'm just being cheeky. Matt Kracht has written a very funny, tongue in cheek guide to some of the most common birds found in North America. He has humorously renamed them so that we might easily remember them. For example, there is the White Breasted Butt Nugget, the Western Meadow Jerk or, simply, the damn crows. He tends to feel about crows the same way I do. The entire page is filled with Caw, Caw, Caw, Caw, Caw..... Yes, that really is all that you need to know about the damn crow, isn't it? Kracht also accompanies each delightful paragraph of information with his own personal illustrations. Okay, some are better than others depending on how well he likes the bird. I won't even show you the illustration of the crow which resembles something a two year old with a black marker might draw in a fit of rage. Again, very aptly done when considering the caw-caw-caw of the crow. Most, however, are beautifully rendered.Despite the irreverence, the information throughout the book, the details, the drawings - with a few noted exceptions - the maps, and the highlights are very informative. If I were teaching children about birds.... okay, well, there is some mild cursing but aside from that, I can assure you that kids definitely would remember these birds better than they would a regular field guide. Absolutely! I know that I will! It also makes for a terrific coffee table book and conversation piece. Guests have adored it! I adore it! I haven't laughed this hard or this much in a very long time!! Thank you to #netgalley, #ChronicleBooks and @MattKracht for my copy of #TheFieldGuidetoDumbBirdsofNorthAmerica\n...more"
            },
            "3": {
                "date": "Feb 29, 2020",
                "content": "I dont see how you can rate this below all the stars honestly. My father-in-law had a copy at my husbands PhD graduation and briefly skimming it made me buy it immediately. Its been a coffee table hit, numerous friends and family have bought it since seeing my copy and its been a strait up TREAT to read through over the past few months. 103837629/10 for this book.\nI don’t see how you can rate this below all the stars honestly. My father-in-law had a copy at my husbands PhD graduation and briefly skimming it made me buy it immediately. It’s been a coffee table hit, numerous friends and family have bought it since seeing my copy and it’s been a strait up TREAT to read through over the past few months. 103837629/10 for this book.\n...more"
            },
            "4": {
                "date": "Jan 11, 2019",
                "content": "I have been bird watching for as long as I can remember. I must have five bird identification books on Birds of North American, West of the Rockies. But, even if you have all of those and more, you will want this book. This book is both snarky, and serious. Funny and fun. It gives you true facts, mixed in with bizaar thoughts.He has also renamed birds, mentioned in here, for his humor and amusement.The Western MeadowJerk, instead of the Western Meadow Lark. The Dork-eyed Junko, instead of\nI have been bird watching for as long as I can remember. I must have five bird identification books on Birds of North American, West of the Rockies. But, even if you have all of those and more, you will want this book. This book is both snarky, and serious. Funny and fun. It gives you true facts, mixed in with bizaar thoughts.He has also renamed birds, mentioned in here, for his humor and amusement.The Western MeadowJerk, instead of the Western Meadow Lark. The Dork-eyed Junko, instead of Dark-eyed Junko.He gives little sort of true, sort of snarky comments about each bird. Until he gets to the crows, whom he refers to as the Damn Crows.Caw! Caw! Caw! Caw! Caw! Caw! That's pretty much it with these jerks..He says a little bit more about the American Robin, whom he called the Dumb-Ass Robin. \"They are an excellent source of food for cats\".About the rock pigeon he writes \"Oh my god, do I even need to talk about this bird? You can blindfold these birds, and they can find their way home. What's even the point? Save your tiny blindfolds for some other bird, I guess.\"This is the sort of guide you can buy as a gift, but that will actually help you identify the birds aorund you. It would also make a good gift to your birding friends. Lots of fun. Thanks to Netgalley for making this book available for an honest review.\n...more"
            },
            "5": {
                "date": "Mar 30, 2019",
                "content": "Well, you just never know about humor. Or alleged humor. This one didn't click with me at all (to my surprise) -- though there are moments. Such as the great cover art! FWIW, my wife didn't care for it, either.For a positive opinion, see Laura's entertaining, illustrated review:https://www.goodreads.com/review/show...Thanks for the reco, Laura. I was looking forward to this one.... Sorry it didn't work out!"
            },
            "6": {
                "date": "Mar 22, 2019",
                "content": "Birds are everywhere totally unavoidable. In parks, in your backyard, even stray ones drift into stores. And their prominence has led to the development of a specific kind of person: the birdwatcher. Now theres a guide for new or expert birders interested in perfecting the favorite pastime of  sitting and watching birds.The tone of this book is set with the title: The Field Guide to Dumb Birds of North America. Author Matt Kracht obviously has an interesting relationship these animals, and his\nBirds are everywhere— totally unavoidable. In parks, in your backyard, even stray ones drift into stores. And their prominence has led to the development of a specific kind of person: the birdwatcher. Now there’s a guide for new or expert birders interested in perfecting the favorite pastime of … sitting and watching birds.The tone of this book is set with the title: The Field Guide to Dumb Birds of North America. Author Matt Kracht obviously has an interesting relationship these animals, and his blunt attitude stretches beyond the cover. Each bird featured includes a notation about their common name, but Kracht also renames them. The White-Breasted Butt Nugget (White-Breasted Nuthatch) and the Western MeadowJerk (Western Meadow Lark) both make appearances, among a flock of fifty. Some of these work better than others, but they all serve for Kracht to degrade what he considers flying monstrosities.Beyond just the names, this book is wickedly funny. Kracht embodies an individual with absolute disdain for all things bird. In his world, their only functions are to make annoying noises and steal food, and he won’t hear a word otherwise. Yes, it’s over the top, but Kracht mocks with absolutely infectious glee, almost goading the reader to challenge his view on why these aviary creatures suck.Even with all the snark, Kracht is careful to load up on facts. He describes their calls, migratory patterns, markings, and includes accurate illustrations. However, it’s the sections that bookend the guide that are both insightful and suggest Kracht might have a softer side when it comes to birds. Here, he discusses the art of birding, picking proper bird feeders, as well as maintaining a bird jounal. His style of ridiculing the hobby and the animal is still on display, but it almost appears to stem from a deep admiration— he’s too cool for bird watching … but it’s still fun.It’s funny, it’s crass, and as a particularly annoying bird would say, “Caw! Caw! Caw!”Note: I received a free ARC of this book through NetGalley.\n...more"
            },
            "7": {
                "date": "Sep 05, 2019",
                "content": "Think its a funny idea but will probably never read. Just funny to read about it.\nThink it’s a funny idea but will probably never read. Just funny to read about it. \n...more"
            },
            "8": {
                "date": "Jan 26, 2020",
                "content": "This book is necessary. As an old fuddy-duddy I think the language goes a slight bit too far. If it avoided the f-word and the lesser blasphemies I would buy a copy for everyone I know. I can't say it is not funny though.The bird scholarship is accurate and the things he mocks the birds for are on point. Good book for the frustrated beginning birder."
            },
            "9": {
                "date": "Nov 06, 2019",
                "content": "Chock full of fowl language. The best pages made me laugh out loud, and that's a huge thing, because I'm not one who is easily humored. The joke does wear thin, however: it's 170 pages of birds are dumb, here's how we can change the name of this stupid bird, whine, complain, and so forth. It was a quick read, perfect for a night when I was considering trading my own children for a house full of birds."
            },
            "10": {
                "date": "Dec 24, 2019",
                "content": "hilarious and entertaining for the bird nerd in your life... great Christmas Eve surprise. Took me an hour."
            },
            "11": {
                "date": "Nov 26, 2019",
                "content": "Birds | Cursing | FunnyRating: 4 starsA non-fiction humorous book about birds found in the wild. It was good but it felt a little short. I would've liked even more birds or more information about each bird. The drawings are a nice addition however. If you want to read a relatively short non-fiction book but also don't want it to be boring and you kinda like birds, pick it up."
            },
            "12": {
                "date": "Sep 09, 2019",
                "content": "An essential purchase if you are even remotely serious about birds. This is the best bird guide in existence, in my opinion. A perfect choice if you want to learn about birds while laughing your butt off. ;-)"
            },
            "13": {
                "date": "Feb 18, 2020",
                "content": "In the past year did you let it slip to your friends/family that you like birds? If so you were likely the recipient of multiple copies of this book for Christmas 2019. It sounds funny and promising but ultimately I think it's a missed opportunity.Who is this book for? Experienced birders, bird-lovers, or people who birders are trying to convert? I couldn't quite figure it out.I like a good joke or pun but I'm not the biggest fan of toilet humour/swearing for swearing's sake, which got really\nIn the past year did you let it slip to your friends/family that you like birds? If so you were likely the recipient of multiple copies of this book for Christmas 2019. It sounds funny and promising but ultimately I think it's a missed opportunity.Who is this book for? Experienced birders, bird-lovers, or people who birders are trying to convert? I couldn't quite figure it out.I like a good joke or pun but I'm not the biggest fan of toilet humour/swearing for swearing's sake, which got really repetitive in this book. How many times can you work the word \"butt\" into a funny name for a bird? It got boring. I wish they'd had someone do a punch up on this book because it could have been a lot funnier instead of the same jokes over and over. Birds are really funny and weird and ALREADY have ridiculous dirty-sounding names (bushtit, woodcock, woodpecker) and I don't think the author capitalized on that enough. It felt lazy.I am all for using ridiculous pneumonics, and the silly bird names in this book probably would be helpful for newer birders to remember names but instead of just inserting \"butt\" or \"shit\" into random bird names I think they could have tried harder to make the silly names actually descriptive and representative of the bird's appearance or behaviour. One really great example where they did do this was the limpkin (\"limpdick\") entry, but it wasn't consistent. If this was meant to be an introductory field guide I don't understand why the addition of info like habitat, behaviour, identifying characteristics was only included for some birds and not all. They had room to do it, didn't make sense why it was only on some pages and not others. Also there was some general bad editing throughout (typos, missing words, etc.).Things I liked - the parts where the author toned down the toilet humour and made it a bit more subtle (intro, end chapters). The drawings are legit awesome. The idea of this book was a brilliant one, but poorly executed in my opinion. If I had someone to illustrate for me and like, a book deal, I honestly think I could have written this better. No disrespect to anyone who gifted this to me ;) Glad for the chance to check it out.\n...more"
            },
            "14": {
                "date": "Mar 17, 2019",
                "content": "I never thought a field guide to birds would keep me laughing the whole way through, but this book has proven me wrong. This is not your book if you are expecting a comprehensive guide to all North American birds, or if you are uber serious about birding. But if you might appreciate Kracht's love/hate relationship with birds and would get a chuckle out of his sardonic obscenities and name-calling, then pick this up and have yourself a funny afternoon! I did actually learn a little bit about the\nI never thought a field guide to birds would keep me laughing the whole way through, but this book has proven me wrong. This is not your book if you are expecting a comprehensive guide to all North American birds, or if you are uber serious about birding. But if you might appreciate Kracht's love/hate relationship with birds and would get a chuckle out of his sardonic obscenities and name-calling, then pick this up and have yourself a funny afternoon! I did actually learn a little bit about the birds he was so lovingly trashing, and thoroughly enjoyed the scribbly hand-drawn pictures. Fun book for the not-so-serious bird-lover!I received a free copy of this book from NetGalley in exchange for an honest review.\n...more"
            },
            "15": {
                "date": "Jan 19, 2020",
                "content": "Lighthearted and funny. Some good zingers that gave me a chuckle but the humor did get repetitive after a while. Would have loved if the book had color drawings to bring some life to his descriptions."
            },
            "16": {
                "date": "Feb 05, 2020",
                "content": "4.5 starsA quick read! Funny and entertaining - yet I still learned some real information from the tidbits he threw in different entries. If you like birds and watching them, but also think they can sometimes be a**holes then this is the book for you! My only complaint - what about mourning doves?! They're my love/hate bird that seem a bit daft but also lovable...maybe in the next edition. :)"
            },
            "17": {
                "date": "Oct 12, 2019",
                "content": "Goddamn hilarious."
            },
            "18": {
                "date": "Nov 18, 2019",
                "content": "As a \"bird-watcher\" I found this book to be highly entertaining. This book takes flight with both love and disdain toward our feathered friends. I found it to be a pleasant mixture of eloquence and sarcasm, humor and wit. I will say that if you are sensitive to the feelings birds may have if they were to read this satire, I'm not sure I'd recommend it...and due to some choice language if you are easily offended by that sort of thing I would steer clear. Otherwise, feel free to dive into this\nAs a \"bird-watcher\" I found this book to be highly entertaining. This book takes flight with both love and disdain toward our feathered friends. I found it to be a pleasant mixture of eloquence and sarcasm, humor and wit. I will say that if you are sensitive to the feelings birds may have if they were to read this satire, I'm not sure I'd recommend it...and due to some choice language if you are easily offended by that sort of thing I would steer clear. Otherwise, feel free to dive into this delightful and brutally honest account of some of North America's less intelligent fowl.\n...more"
            },
            "19": {
                "date": "Apr 01, 2019",
                "content": "Birds are the absolute worst, and Matt Kracht is one of the few birders brave enough to admit it. Whether you have a true affection for these feathered jerks or you hate them just as much as they hate you, this hilarious book of bitter observations and grudgingly brilliant illustrations is a satirical look at bird watching perfect for people who know deep down just how horrible birds really are. My thanks to Chronicle Books and Edelweiss+ for providing an advance copy in exchange for an honest\nBirds are the absolute worst, and Matt Kracht is one of the few birders brave enough to admit it. Whether you have a true affection for these feathered jerks or you hate them just as much as they hate you, this hilarious book of bitter observations and grudgingly brilliant illustrations is a satirical look at bird watching perfect for people who know deep down just how horrible birds really are. My thanks to Chronicle Books and Edelweiss+ for providing an advance copy in exchange for an honest review.\n...more"
            },
            "20": {
                "date": "May 24, 2019",
                "content": "I received a free copy of this book through the LibraryThing Early Reviewers program. [Warning: strong language.]Even though you are unlikely to have considered the question before now, you probably already know whether or not you'd enjoy a profane bird guide. I love the idea; the title and the cover art had me laughing right away. The hand-drawn art is beautiful throughout, and the author's love for birds and birding is clear, despite his ostensibly hostile tone. After a while, though, the joke\nI received a free copy of this book through the LibraryThing Early Reviewers program. [Warning: strong language.]Even though you are unlikely to have considered the question before now, you probably already know whether or not you'd enjoy a profane bird guide. I love the idea; the title and the cover art had me laughing right away. The hand-drawn art is beautiful throughout, and the author's love for birds and birding is clear, despite his ostensibly hostile tone. After a while, though, the joke felt repetitive to me. I think I might prefer to read an alternate-universe edition hewing more closely to the present cover design, with a specific focus on the low intelligence demonstrated by the birds' (fictional) behavior.Each bird gets a two-page spread, pairing a full-page illustration with an insulting name, followed by a common name that explains away the joke. (Isn't it enough to describe the \"Red-winged Buttwad\" without clarifying that most people have traditionally called this a Red-winged Blackbird?) Maybe one could wish for more from the names, but I had fun arranging them along a continuum of antipathy: Dumb Western Bluebird, Dumb-Ass Robin, Stupid-Ass Steller's Jay, Damn Crows, Goddamn Song Sparrow, Goddamned Canada Goose, Fucking Pigeon, Motherfucking Bald Eagle. (In fact, the eagle probably belongs at the other extreme.)A paragraph or two of text identifies the defining features of each species, and expresses the author's disdain for it. Often, this is pretty funny. See under \"Red-winged Buttwad,\" for example: \"Southern and some lazy western populations don't migrate at all. Interestingly, who cares, because they're already everywhere.\" Or under \"Great Blue Moron:\" \"[I]t's always trying to choke some giant fish down its stupid neck. There are plenty of other fish that would fit.\"Extra sections offer tips on bird-watching. Ordinarily, I wouldn't be in the market for that advice, but it's made more palatable by the author's casual cynicism.I have to mention that the editors missed a couple of things along the way, including the substitution of \"who's\" for \"whose\" twice in a single sentence.\n...more"
            },
            "21": {
                "date": "May 03, 2019",
                "content": "This guide is like no other, in that it exclusively categorizes birds based on who they are deep down inside. Some are loud, some are losers, some are gray, and all of them are birdlike in appearance. For a fresh and entertaining insight into the lives and motives of birds, look to the distinguished bird watcher critic Matt Kracht. One can assume from the title that this is a satire on typical bird guides, and it is well worth the read, not only for bird lovers (or bird haters), but for anyone\nThis guide is like no other, in that it exclusively categorizes birds based on who they are deep down inside. Some are loud, some are losers, some are gray, and all of them are birdlike in appearance. For a fresh and entertaining insight into the lives and motives of birds, look to the distinguished bird watcher critic Matt Kracht. One can assume from the title that this is a satire on typical bird guides, and it is well worth the read, not only for bird lovers (or bird haters), but for anyone looking for a laugh. It is laugh out loud funny, but also teaches much about birds in the meantime. Each bird includes a colorful sketch, a unique description, and a witty nickname. It is an inventive way to make birds more memorable, and to help those who are curious about birding get started.With a disclaimer for the rough language, this cheeky guide is as informative as it is wickedly funny.\n...more"
            },
            "22": {
                "date": "Dec 25, 2019",
                "content": "Today was a bird day, in that I learned about birds. They fly most of the time and some of them seem pretty neat. I would like to meet them someday."
            },
            "23": {
                "date": "Jan 20, 2020",
                "content": "Very funny. Finally someone who sees birds for the jerks they are."
            },
            "24": {
                "date": "Dec 16, 2019",
                "content": "Basically a field guide written by April Ludgate. Perfect for bird-lovers and bird-haters alike!"
            },
            "25": {
                "date": "Apr 03, 2019",
                "content": "birbs! soemtimes funny."
            },
            "26": {
                "date": "Nov 13, 2019",
                "content": "Don't you just desperately need a laugh? Can we all just make fun of birds one last time before they all vanish? This book takes all the angst of life and turns a firehose of fake spite at the most innocent and lovely of creatures (or are they? those murderous jerks). I gave it as a present before I finished it, but this book gave a burst of loft under my wings when I needed it."
            },
            "27": {
                "date": "May 12, 2019",
                "content": "Too funny! Hilarious, quick read. Those darn birds."
            },
            "28": {
                "date": "Nov 03, 2019",
                "content": "It was really funny in the beginning but after a bit the humor was wearing thin on me. Maybe my mood who knows."
            },
            "29": {
                "date": "May 06, 2019",
                "content": "This guide is like no other, in that it exclusively categorizes birds based on who they are deep down inside. Some are loud, some are losers, some are gray, and all of them are birdlike in appearance. For a fresh and entertaining insight into the lives and motives of birds, look to the distinguished bird watcher critic Matt Kracht. One can assume from the title that this is a satire on typical bird guides, and it is well worth the read, not only for bird lovers (or bird haters), but for anyone\nThis guide is like no other, in that it exclusively categorizes birds based on who they are deep down inside. Some are loud, some are losers, some are gray, and all of them are birdlike in appearance. For a fresh and entertaining insight into the lives and motives of birds, look to the distinguished bird watcher critic Matt Kracht. One can assume from the title that this is a satire on typical bird guides, and it is well worth the read, not only for bird lovers (or bird haters), but for anyone looking for a laugh. It is laugh out loud funny, but also teaches much about birds in the meantime. Each bird includes a colorful sketch, a unique description, and a witty nickname. It is an inventive way to make birds more memorable, and to help those who are curious about birding get started.With a disclaimer for the rough language, this cheeky guide is as informative as it is wickedly funny. –ADClick here to place a hold: \nThe Field Guide to Dumb Birds of North America\n.Another book that covers scientific topics in a humorous fashion is \nWhat If?: Serious Scientific Answers to Absurd Hypothetical Questions\n by Randall Munroe.\n...more"
            }
        }
    }
]